{
    "ORxKf1FN3ro": {
        "transcript": "You can never see anything enter a black hole imagine you trap your nemesis in a rocket ship and blast him off towards a black hole he looks back at you shaking his fist at a constant rate as he zooms in gravity gets stronger so you would expect him to speed up but that is not what you see instead the rocket ship appears to be slowing down not only that he also appears to be shaking his fist slower and slower that's because from your perspective his time is slowing down at the very instant when he should cross the event horizon the point beyond which not even light can escape he and his rocket ship do not disappear instead they seem to stop frozen in time the light from the spaceship gets dimmer and redder until it completely fades from view",
        "token_count": 149,
        "link": "https://www.youtube.com/watch?v=ORxKf1FN3ro"
    },
    "DJO_9auJhJQ": {
        "transcript": "- arthur c. clarke had a sequel to \"2001, a space odyssey.\" it's called \"2010, odyssey two.\" and at the end of it, an alien intelligence converts jupiter into a star. As a group of astronauts narrowly escape the implosion, they receive the following message from the aliens, \"all these worlds are yours, except europa, attempt no landing there.\" now that was just a novel, but it suggests that already in 1982, we suspected that europa might offer our best chance of finding alien life in the solar system. 42 years later, in october 2024, nasa is actually launching the most advanced mission to hunt for signs of alien life. And it's going to jupiter's moon europa. There's just one problem, jupiter kills everything around it. So how could life exist there? And how do you make a probe that can withstand the perilous conditions? (suspenseful music) (gentle music) deep inside jupiter, there is so much pressure, that hydrogen is believed to take the form of a metallic liquid. And this metallic liquid hydrogen generates an incredibly powerful magnetic field, almost 20,000 times stronger than earth, if you measure at the same distance away. So if you could see this magnetic field from earth, it would appear twice as big as the full moon. On its own, that magnetic field is harmless. But right in the middle of it is the most volcanically active world in the solar system, jupiter's moon, io. The volcanoes on io's surface shoot out tons of sulfur dioxide, and every second, one ton of this material gets ionized and trapped inside jupiter's magnetic field. And the field accelerates these particles to rotate incredibly fast with jupiter. So they whizz around at over 300 kilometers per second. Their inertia actually pulls back on the field, stretching it out. And this trapped material slams into other moons, ejecting even more particles from their surfaces. This cycle forms massive radiation belts which span past europa and the other moons of jupiter. Now, for electronics, this intense radiation is kryptonite. In the 1970s, the pioneer 10 and voyager missions only briefly passed by jupiter, but the radiation caused glitches, gave the instruments false commands, and corrupted some of their data. Even with modern shielding, a spacecraft within the radiation belts would only survive for around three months. So how will nasa's new mission, the europa clipper, orbit europa for over four years without getting fried? Well, the solution is, it won't. It'll orbit jupiter from afar and then swoop in every few weeks to quickly fly by europa and then leave again. And since the mission is going to collect a lot of data, it can use the downtime while it's way out here to transmit it all back to earth before going in for another swoop. In all, it'll do 49 flybys, mapping almost the entire surface. That's actually how the clipper got its name, after the fast and nimble 19th century clipper ships, quickly dipping in and out of ports. But of all the places in the solar system to look for life, why europa? If you stood on europa's surface, you'd be hit with 5,400 millisieverts of radiation in a single day. That's 1,800 times more than the annual dose here on earth. If you stay here for a couple of hours, you would eventually die from radiation sickness. But europa contains a secret. When voyager 1 passed by jupiter in 1979, it took this photo of europa. If you compare it to most of the other moons in the solar system, you'll notice something is missing, craters. Every planet and moon has been bombarded by asteroids over billions of years. And most planetary surfaces show it. But not europa. So why not? Well, something recent, say over the last 60 million years or so, must have been happening on europa to erase most of these craters from the surface. 16 years after voyager, galileo arrived to jupiter. It spent eight years studying both the gas giant and its moons. And galileo's magnetometer picked up something interesting on europa. Jupiter's magnetic poles, like earth's, aren't aligned with its geographic poles. So as the planet rotates every 10 hours, the whole magnetic field wobbles. This changing field from jupiter induces a magnetic field on europa, and a relatively strong one at that. That means there must be an electrically conductive layer within europa that reacts to jupiter's field. And readings from galileo indicate that it must be somewhere close to the surface, only 10s of kilometers deep. So what kind of conductive layer? Well, europa's white surface is almost entirely covered in a thick crust of water ice. These reddish-brown regions, when observed through a spectrometer, fit the description of a lot of things, like hydrated salts, sulfuric acid or even bacteria. We need more data to be sure, but recent experiments at jpl found that sea salt when bombarded with intense radiation, turns from white to this same brownish color found on europa. So scientists suspect that there's a whole saltwater ocean inside europa that could be 100 kilometers deep. Meaning that europa would contain twice as much water as the whole of the earth. And it must driving geological activity that constantly smooths out and renews the surface of the moon. But the jupiter system only gets about 4% of the sunlight we get here on earth. So europa's surface is constantly below -160 deg celsius, so you'd expect the ocean to be frozen solid. But there's a way to generate heat that doesn't rely on the sun. And i've got a little demo here to prove it. Europa's orbit around jupiter isn't a perfect circle. This is because io, europa and ganymede are in orbital resonance. Each time ganymede completes one orbit, europa completes two and io four. Because of that, io tugs europa inward on one side of the orbit, while ganymede pulls it out on the other, making its orbit more eccentric. Now, jupiter's pull is stronger on the closer side of the orbit than on the farther side. So europa is constantly being stretched and squeezed, stretched and squeezed. And you can see how this rubber ball gets warmer as i squeeze it. Scientists believe that the friction caused by the tidal flexing of the entire moon can generate enough heat to keep the ocean liquid. This effect gets stronger the closer you are to jupiter, which is why io is so volcanically active. So you can see this ball is significantly hotter now. I held onto this ball at the same time to make sure that it wasn't just the heat coming in from my hand. What sort of temperature of the ocean are we thinking? - so it depends on how salty it is. So, melting temperature of ice or maybe depressed by 10 degrees celsius below that if it's a very salty ocean. Similar to cold oceans on earth. - and how would the flexing differ if there's this big liquid ocean versus if there's no ocean there? - if there's no ocean, europa should flex by only about one meter in amplitude. But if there's an ocean in there, then it flexes with an amplitude of 30 meters. So that's an enormous deflection. And that will come out pretty clearly in the gravity data. Another argument for how thick the ice shell is, we see these very strange features on the surface that are arcuate in shape, but like multiple arcs put together. We call them cycloids. Not something you'd expect to see on an icy moon. And we think they form if a crack propagates at just the right speed, about the speed someone would walk, and is following the changing stress field of europa being squeezed as it orbits around jupiter. And if there were no ocean down there, there wouldn't be enough of an amplitude of that motion to explain the cracking. But if there is an ocean, then it could explain the cracking. - all that tidal flexing pushes magma in the outer core up, closer to the seafloor. Water flowing through the crust above it is heated and it picks up minerals from the ground, ejecting them into the ocean. This creates hydrothermal vents. And where we find these on earth, we also find life. Thousands of meters below the surface, with no sunlight, these vents are oases for ocean life. The lifeforms down here rely on unique bacteria, bacteria that feed on the minerals from the vents, rather than on the energy provided by the sun. How long are we thinking that europa has had an ocean? - it could be four billion years, we don't know for sure. - that amount of time could give life the opportunity to evolve in those oceans? - right, exactly right. Organisms can use methane, carbon dioxide, sulfur reactions. Any chemical reaction you can think of that might happen in the ocean can potentially be used as a fuel for that organism's metabolism. So we're not talking about searching for fishes, or whales or squids or something down there, but looking for single cell organisms. - we were so concerned there might be life on europa that, when the galileo mission was ending in 2003, it was deliberately crashed into jupiter to avoid the risk of contaminating europa. But clipper will not be able to drill through the kilometers-thick ice crust. So how are we going to find evidence for life beneath that thick surface? This is the snotbot. It's a drone with petri dishes glued to the top, and it flies right through whale blows to collect whale snot right here on earth. And zoologists can use the snotbot to retrieve all sorts of info on a whale's biology. And it turns we can do something very similar for celestial bodies too. We've actually captured images of water geysers shooting out of enceladus, a moon of saturn, housing a subsurface ocean. And the hubble space telescope has picked up some evidence of what could be similar geyser eruptions on europa. The hope is that clipper could fly through one of these plumes, like the snotbot, and reveal their chemical composition using a mass spectrometer. But evidence for an ocean on europa isn't conclusive. Enceladus seems like a stronger candidate, we have actual images of its plumes and we've even flown through them. We are almost 100% certain there's a subsurface ocean there. If we have these plumes on enceladus and there's clearly maybe a liquid ocean there, why does europa have your attention more than enceladus? Is there something that draws you? - we don't know how long it takes life to get going, but it's possible that enceladus may have just kind of started up its engines, whereas europa has more likely been well evolved over a long time. - surprisingly, being bombarded by jupiter's radiation actually makes europa a better candidate. See, those high-speed particles hitting europa's surface give water and carbon dioxide molecules enough energy to form new compounds, like formaldehyde or hydrogen peroxide. And these can serve as food for life beneath the surface, if they can get down that far. - and we have evidence of overturn of the icy shell at chaos zones where the icy crust seems to have collided and material has been shoved into the icy shell. So there may be ways for this fuel for life to get down into the icy shell and potentially to the ocean. - [derek] and clipper doesn't have to touch down on the surface to confirm this. - there's an infrared spectrometer to look at the chemical fingerprints of light bounced off the surface to help identify and map out where the salts are, find if there are organics there. There is an ultraviolet spectrograph that's aboard the spacecraft to look for plumes. Are they there? And of course, then can we fly through them? And then there'll be imaging of essentially the whole globe at better than 100 meters per pixel resolution. So one camera will take swaths of images as we fly over the surface and that's called the wide angle camera. And then the other camera is the narrow angle camera. From 50 kilometers altitude, it will get half meter per pixel images, right? So it'll be able to resolve my desk here if it were on europa. And then it would be a future mission, like a lander that would go and actually search for signs of life on europa. - do you think a lander would have a chance of survival? - there have been studies that say we can get a lander living on the surface for a month. If we think that's sufficient to go in there, scoop some stuff up from below the depth of radiation processing, and put it into a mass spectrometer and see what we see. - but the europa clipper won't be studying jupiter's moons alone. The european space agency's juice mission, or the jupiter icy moon explorer, is already on its way to jupiter. It will come to the system just 15 months after clipper and it'll even be doing a few flybys of europa, before settling into a tight orbit around ganymede. So the european space agency will also have a mission there at the same time? - yes, we're having informal conversations with members of the juice science team. What would it mean to have two spacecraft there at the same time? The juice mission will end up in orbit around ganymede and ganymede has its own magnetosphere. Well, we'll be outside ganymede's magnetosphere. So we might say, \"oh, look, there's this big burst coming from jupiter.\" and then juice might say, \"oh, we felt that over here in our magnetic signals.\" so we wouldn't have to really do anything different except talk to each other and make sure that the sum of the whole is even bigger than its parts. - europa clipper was scheduled to launch on october 10, 2024, but nasa is waiting for hurricane milton to clear florida before the spacecraft can take off safely. When will we get the first results? - you'll start seeing distant observations coming in in 2030 as we look at europa from afar and search for plumes. And then you'll see the first really high resolution data in 2031. - so after say 26 years of thinking about a mission to europa, how does it feel to be so close to launch? - it's a little surreal, (laughs) i must say. This has been such a long time coming. It's occasionally hitting me that our spacecraft is going to be up there in the heavens, right, on its way. It turns out that, during a europa ocean conference in the late 1990s, nasa actually video-called arthur c. clarke. And after showing him plans for a future mission to explore the faraway ocean world, clarke finally gave nasa permission to land on europa. (monitor whooshing) europa clipper is a perfect example of the amazing things we can do when we set ourselves ambitious goals and work together with others to achieve them. But i think we often get wrapped up in our everyday lives and forget just how much of an impact we can make on the world. That's true on a society-wide level, like these big international space missions, but i also think it's true at an individual level. You yourself can probably accomplish much more than you think when it comes to making the world a better place. And today's sponsor, 80,000 hours, wants to help you do just that. They're not selling anything. 80,000 hours is a nonprofit that can help you work out a plan for achieving a big, positive impact in the world, and then executing on it. Career advice typically aims to help you find a job that suits your preferences. But what if you really care about helping the world? Well sure, they can tell you to be a doctor or a teacher, but these aren't your only options. Which is why 80,000 hours have done over 10 years of research into how to find a career that does a lot of good, and also feels satisfying. They have everything from an in-depth career guide, to a podcast on the world's most pressing problems and how we can solve them. They even have a curated job board with hundreds of high-impact career opportunities. And everything they provide is free, forever. So if you want to make a difference with the 80,000 hours you have to shape your career, then sign up now at 80000hours.org/veritasium. There's a link in the description or you can scan this qr code. So, i want to thank 80,000 hours for sponsoring this video, and i want to thank you for watching.",
        "token_count": 3567,
        "link": "https://www.youtube.com/watch?v=DJO_9auJhJQ"
    },
    "cUBz04LlLVk": {
        "transcript": "- [derek] this is the first in a series of videos about a chemical reaction discovered over 125 years ago. It releases a tremendous amount of heat. Oh no, the gopro. Liquefying metal. It is so hot. It is not an explosive, but it can cause explosions. That is crazy! But the reactants are so inert, they can withstand a blow torch indefinitely. Do you think this whole thing's going to blow up in my face? In fact, when hollywood directors wanted something that looked like a nuclear bomb, this is the reaction they chose. But in its most common use, one basically unchanged in over a century, it has helped move billions of people all over the world. In the late 1800s, karl and his younger brother, hans goldschmidt, were preparing to join the family business. Their father owned a chemical factory making dyes for fabrics. So they studied chemistry under robert bunsen of bunsen burner fame. After their father's early death, karl took over management of the company, later joined by his younger brother. One of hans' first major research aims was to find a way to produce pure metals. These were essential for making dyes for everything from clothing and tablecloths to wallpaper. At that time, good dyes were hard to come by. Most were faint and faded further after use. Some required the collection of large quantities of exotic insects. These days, we take color for granted, but in this drab world, people would pay handsomely for bright color fast dyes. One such dye was scheele's green, which was chemically copper arsenite. As its name suggests, it was toxic, though exactly how toxic is a matter of debate. Still, it became the dominant green dye by the end of the 19th century because its color was unbeatable. The red color of the british army officer's coats was made from cochineal, a central american insect mixed with tin. The addition of tin made the color darker and more intense. So the demand for pure metals was strong. - they had their experience in purifying metals by dissolving them in solutions or in acids and all kinds of things. - [reporter] the incoming cyanide solution goes on dissolving the particles of gold left in the sand after amalgamation and liquefies it. - and then work with the salts, purify the salts, and then reduce the salts into the metal state. And every step that you would take would then again cause problems, right? Reducing it in a furnace, you have to deal with all the exhaust and the contamination through the carbon. - [derek] and metals are very difficult to separate from each other. - they basically, they form a mixed crystal, right? - like an alloy. - like an alloy, right. They all become, in a sense, one substance that has one melting point, which is why you have to kind of take some steps to separate them. - [derek] so hans came up with a novel idea. He would react a metal oxide like chromium oxide with aluminum metal, and his hope was that the oxygen would swap partners, forming aluminum oxide and pure chromium. This type of reaction is now known as an aluminothermic or thermite reaction. So i have come to visit electro-thermit in germany, a company that is a direct descendant of goldschmidts. I feel like they've set this up like a tour of willy wonka's chocolate factory, but instead it's a thermite factory. Here we are going to try to replicate han's first successful reaction. All experiments in this video were performed under the supervision of professionals taking proper safety precautions. - originally, the first experiment was using chrome, but we are using copper, which is comparable. - [derek] this is like 300 grams. - [axel] yeah, 300 grams of thermite. - pour it in? all right. We pour it into the crucible and ignite. All right. - yeah. - that's it. - yeah. (shouts) - leave it, leave it, leave it. - whoa! (laughs) that is like fireworks. well, that's impressive. - [axel] but you bet he was surprised when he saw that. (both laughing) handful of aluminum powder, and then you get this. - [derek] as you can see, the reaction releases a lot of energy. The temperature of thermite reactions typically exceeds 2,000 degrees celsius, and it can be as much as 2,500. That's because aluminum forms very strong bonds with oxygen. When those bonds form, they release a lot of energy, way more than is required to break the copper oxide bonds we started with. This energy melts all the products of the reaction and makes them glowing hot. It is hard to express just how bright they are. It feels like staring at the sun. If you see clips in this video where the highlights are overexposed, it's because it is so hard to judge how bright the reaction will be, and it's almost always brighter than you expect. So that dropping down the bottom there, is that liquid copper? - [axel] that's liquid copper and basically the solution that was being created. - [derek] but if you get this hot mixture of pure metal and aluminum oxide, how do you separate the two materials to isolate the pure metal? We're trying to set up an experiment that no one has ever seen before and it's actually going to allow us to see inside the crucible. We cut the crucible in half and we're attaching two pieces of thermally resistant glass, each four millimeters thick, as a window into the reaction. People said this would be impossible, that you wouldn't be able to see anything or that the glass would just break. - we've never done this on camera and really seen it this way, this clear. And i think it's going to be fascinating to then start to analyze and make sense of this. - now this glass has been specially treated, so it shouldn't shatter immediately when it comes into contact with molten metal. Ah, that is hot. that is really hot. But the melting temperature of silica is around 1,700 degrees celsius, which is definitely lower than the temperature of the reaction, so the glass certainly will melt. The hope is it melts slowly enough to contain the reaction. - the glass will melt and at the end, we have just a very thin layer of the glass at the end. So you will ignite it. it's up to you to place the igniter. - i think someone else should ignite it. I think someone else should ignite it. - [christof] why? - because i don't trust myself. We saw how incapable i was of igniting yesterday. That's it? (shouts) - leave it, leave it, leave it. - [derek] for this reaction, we'll be using iron thermite, so a combination of iron oxide and aluminum metal. Okay, that's good. let's do this. Holy. Oh no, the gopro. Oh boy. Oh no. Oh no. That's the end of the gopro. The reaction starts at the igniter and expands outwards in all directions. To me, it almost looks like ants or mold or something. It looks organic in how it's sort of spreading. You see a pulse. boom, boom, boom. - [christof] it's living. - yeah, that's what it looks like. Why is there pulsing? - i don't know. - okay. - we try to understand. - huh. - we never knew that it did that. We do this for 100 years and and suddenly you find out, you know, every portion that gets ignited does that. - do you think that's gas escaping up and that's almost what causes the pulsing? Like some gas heats up and then it shoots up and then it makes space for the next one? That's what you seem to see over here. - [christof] yeah. - wow, that is hot. that is really hot. I wanted to get a closer look, so i asked them to put some thermite on top of glass, and then i would shoot from below using this probe lens. - i'm ready. - okay, we're rolling. It's rolling, it's rolling, it's rolling, it's rolling, it's rolling. There it goes, there it goes, there it goes, there it goes, there it goes, there it goes. Wow! yeah! The exposure's pretty good. Oh my goodness. incredible. This is the closest i think anyone's ever filmed a thermite reaction. You can see that the reaction proceeds in bursts, it reacts fast, but then pauses for a moment before advancing again. - should i take it? - sure. Yeah, take it, take it, take it, take it, take it, take it, take it, take it, take it, take it, take it. Oh boy. I have two ideas about why this might be. First, there might is a mixture of grains, big particles of aluminum and iron oxide, and they need to be present in the right ratio to react efficiently. Maybe a little pocket reacts out to where the ratio is slightly less ideal until the heat builds up enough to trigger the reaction in the next pocket. My second idea is that in between the grains, there is air. The reaction heats the air, which expands, increasing the pressure between the grains and possibly pushing some of the unreactive material away from the reaction front. So once that air escapes, the next patch can ignite. Once all the thermite has reacted, things get really violent. Molten metal is ejected out of the top of the crucible, and inside, the liquid is sloshing around. This could be due to some of the materials boiling, actually turning from liquid into a gas. Now, i know it sounds wild to think about metals boiling, but the boiling point of aluminum is around 2,500 celsius. Iron boils above 2,800 celsius, and there are other elements in the mixture like manganese that boil at just 2,000 celsius. Now, once that boiling stops, the liquid settles down, and now comes the key to making pure metal. The density of liquid iron is more than twice that of liquid aluminum oxide. So iron settles to the bottom as aluminum oxide floats to the top. Now, when the metal melts through the bottom of the crucible, the first liquid to pour out is iron. Only after it has drained does the aluminum oxide or slag follow. You can actually see the change from iron to aluminum oxide. Liquid iron has a viscosity like water, so you can see it coming out there and splashing. And then the slag starts right there. Yeah, it comes out smooth. - [christof] really, really cool. - whoa. - [christof] and this is more like warm honey. - [[derek] yeah, you can totally see it. Wow. It definitely gives you a sense of being right there. And you can see the flames coming off the front. And it still records. Look at the bubbles on the glass. You see those bubbles? And that beautiful shot of the iron pouring out. I mean, this is impressive work for a camera that's on fire. We're going to put a cobblestone, normal street paver inside here. It's made of limestone. We'll pour the thermite on top and then ignite it. And then we'll see that the cobblestone is less dense. Then that solution, it's going to come up to the surface. - yeah. - whoa. okay. It looks like it's breaking into pieces. That's a good bit of lava. - [axel] did you see it? - oh yes. Ordinary rocks like cobblestones rise to the surface, just like the slag, as the denser metal drops to the bottom. And this is key to producing high purity metal in the crucible. So hans goldschmidt had developed a process to make pure metals like chromium, copper, and iron. This could be great for chemistry in making dyes, but hans suspected it could have even broader applications. He patented the process in 1895 and wrote it up for publication. He wrote, \"the procedure that i have here is in its principle so extraordinarily simple that i could hardly have undertaken the time to present, if not for its surprising and extraordinary effects.\" thermite was a solution looking for problems. One of the first applications of thermite was to weld metal parts in remote locations. - wherever you need a very, very strong, very reliable weld and kind of a remote area where you don't have the luxury of bringing, you know, tons of equipment and tons of welding gear, that is useful for thermite. You know, some of the first customers were in fact shipping companies. When some shaft would break in the middle of the ocean, at the time, you would be lost. And now having like thermite to be able to at least fix that in some way that would get you home was actually very useful. It was being able to fix something or to fix cracks in engine blocks and to be super mobile with it, because you know, like we said, it takes two guys and the bucket. - of course, in this case, the iron thermite would actually not produce pure iron, but rather steel. This was done by including carbon and other alloying elements in the thermite powder. - nobody needs pure iron. pure iron is actually useless. It's very soft, it corrodes immediately even in dry air, and nobody will want that, right? - you need iron with some carbon in it. - exactly right. You need iron with some carbon, that makes it a steel. - so the majority of thermite produced today is steel thermite. - you have this steel mill that you can, you know, move wherever you want it to have. After the end of the cold war, we would use thermite basically to destroy, say gun barrels from tanks. Basically you have a portion of thermite that you basically stick into the gun barrel and then you would ignite it and then it would basically weld the gun barrel and destroy it and it would be completely useless afterwards. Those are all kinds of weapons or stuff that were not useful anymore that we use thermite to destroy because it's very quick and it's very safe. - and it's very final. - and it's very final. Once you've put that in, there is absolutely no way of making use of that weapon again. - a modern application of thermite is to use the heat generated to destroy information. Past a certain temperature, the curie temperature, magnets lose their magnetism. So information stored on magnetic hard drives at high enough temperatures becomes unrecoverable. This looks like a very different form of thermite. - yes. - i'm used to seeing it as a powder. - before it was also powder and we dry it. - can i pick it up or? - yes. - i mean, it's like a normal piece of tile. - yeah, lay it down. - whoa. (laughs) that's amazing. That is cool. So if we want to make sure no one can read the information on this hard drive, i could put this on top? - yeah. - there you go. When we ignite the crucible, we have this high temperature for a short moment. And here we have it for 10 minutes, so everything is destroyed. - so you're controlling the energy release to make it slower here. - yes. the temperature's not so high, and reaction is slower. - i am going to light this thermite tile in all four corners, and it's going to generate heat for about 10 minutes, and we'll see what it does to this laptop. All right, let's light it. Ooh, i like this. See how it's oozing? whoa. It's a totally different effect. Whoa. Yeah, that's getting hot. It's getting to the laptop now. this is really cool. Like you got to see the molten goo coming out from underneath that laptop. That is wild. After seeing so much thermite, this is a totally different version of it. Look at the puddle of metal there. Oh. Yeah, nobody's getting any data off that laptop. That is awesome. I did not expect to see the logo in thermite. Can i lift it? - [christof] of course. (both laughing) - i've never destroyed data like this before, but every time i get a spam call, i wish i could just magically make the records of my phone number disappear. Fortunately, today's sponsor incogni can help. Now, i used to get several spam calls a day, which frustrated me so much that i contemplated making a video where i would just mess with these spam callers to get a small amount of revenge. But ever since i started using incogni back in april, i no longer have to because they solve this problem for me. You see, there are a lot of data brokers out there that collect all sorts of different information about you, like your name, phone number, email address, and even your social security number. And then they sell this information on the open market, which is why you can get calls from people who you've never even given your number to. But incogni battles these data brokers. You simply give incogni permission and they figure out who has your data. And then they know which laws apply, and so they can send the right letter with the correct legal terms to each data broker with the request to remove your information. What i love about incogni is that it's super easy to use and it actually works, and it saved me a ton of time. So far, they filled out 192 requests on my behalf, 145 of which have been completed, saving me over 108 hours of work. And it just keeps running in the background, continuously protecting me against these data brokers. The best part is that since i've signed up, i've hardly gotten any more spam calls. So to try incogni and fight against the data brokers, visit incogni.com/veritasium. Click that link down in the description or scan the qr code right here. And make sure to use the code veritasium to get 60% off the annual subscription. Head over to incogni.com/veritasium to get started yourself. So i want to thank incogni for sponsoring this part of the video, and now back to thermite. Now you might think, given the amount of energy given off that thermite could be used as an explosive, but it's actually not well suited for that purpose. - what makes thermite so interesting and so important is that you can control it so well. If you have an explosion, you can kind of calculate the energy really well and say it's, you know, x amount of megajoules that you get out, but it's really hard to say over what time. - maybe one of the reasons why this is not explosive is because when you have explosive reactions, typically your reactants are solid and the products are gases, which obviously expand a lot and create a lot of pressure. But in this case, both the reactants and products are solids? - they're solids and liquids. - yeah, right. You have so much control over what's going on. - woo. i feel like i got a sunburn from that. This property makes it possible to take down structures where explosives would cause too much damage. In 1933, 4 weeks after adolf hitler became the chancellor of germany, the reichstag building in berlin was set on fire and it would only be fully repaired 24 years later. But the burnt out steel dome had lost its structural integrity and needed to be removed. Now, conventional explosives would've caused irreparable damage to the rest of the old building. So on november 22nd, 1957, thermite charges were strapped to the dome and when ignited, they melted through the steel, which fell neatly into the former plenary hall below, allowing the repairs to be completed. Applications like this are possible because the thermite reaction can be carefully controlled. They have the ingredients so dialed in that you can actually ignite thermite indoors without fear of molten metal flying all over the place. This mixture includes some pieces of pure steel. They don't participate in the reaction, but they do absorb heat as they melt. So they help control the rate of reaction and the temperature reached. - [axel] there you go. - all right. - that's it. - that's it? - yes. - i don't think it was in. oh boy. Whoa. Wow. - it's interesting, like looking at it through dark glasses, it looks like a cornbread muffin or something. One of the really important parameters to control is how long after the reaction starts does the metal start flowing out the bottom of the crucible. This is known as the tap time. It's critical because if the tap time is too short, the metal inside doesn't fully separate from the slag. But if the tap time is too long, then the metal dissolves more silica from the walls of the crucible and it also comes out colder than it could have been. - so the chemistry of the steel actually changes over the time. - the longer it stays in there. - exactly. The log it stays in there, and this is why it's very important for us to be able to control how long it actually stays there. - you want the tap time to be somewhere in the middle, just right. We've set up this experiment here to test. Can we control the time when the steel comes out? So the idea is it should come out of this one first, then this one, then that one. We're going to ignite all three simultaneously and see what happens. - you good? 3, 2, 1. Yes. They all ignited at almost exactly the same time, but the top time of the first crucible, we got one, was by far the shortest. Two. It'd be amazing if this one stops and the third one goes, like that would be very, very impressive. Come on, third one. wow. That's great. that's fantastic. Another attribute that can be controlled is the temperature of the metal. - here we have two different versions. So we have a version with 12% damping, and here we have with 25. - sometimes you want the metal to come out a little hotter or a little colder. There we go. nicely controlled ignition. Well, that one goes a lot more. wow. You could see the 12% one went first. Whoa! You can see that, you know, this one starts first, so you can get a bit of a sense, but i feel like both of them reached 2,000. I don't know. - the one on the right side is one of the less dampened portions, and the other one is one of the more dampened ones. We could dramatically change the temperatures in both directions, a little bit higher and significantly lower. - [derek] all of this control is achieved by carefully adjusting the thermite mixture. - this is the starting point of the making of thermite. About once or twice a day a truck comes and drops in this. This is mill scale. So this is basically a mixture of different iron oxides. When you hot roll steel, the surface of the steel is very reactive because it's so hot and there is so much water involved to cool the rollers, so that the surface actually oxidizes very quickly and creates this mill scale. And then they use like water jets to blow it off the steel surface. And for the rolling mill, this is just a waste product, right? - [derek] whoa. - [axel] there you go. - that is cool. - the mill scale from outside comes in here and then gets dried because thermite and water, they're not exactly friends and you want the mill scale to be as dry as possible and then stay dry, so this is how we dry it. - the iron oxide is shaken up the spiral ramp to the top floor, and there, the particles are separated into different sizes and compositions before being mixed with aluminum powder. This also has to be very dry, i imagine. - it's not as much a problem here because the way that it's being manufactured doesn't contain any water. With the iron oxide, it's getting blown off with the water jets. We have to control all the elements, the reactive elements, which is the iron oxide and the aluminum to make sure that every portion has their very defined reactivity. And then we get the reaction that we want and also the chemical qualities in the steel that we want. - you guys use this word portion. - portion, yeah. that's the word that we use. A portion is basically one bag of thermite. - no cameras. - [cameraman] always breaking the rules, this guy. - [derek] so the portions are bagged up individually and stored in the warehouse. - this is our warehouse, but this is only one of them. And this is not even the biggest. - can i ask you one question here? Okay, yesterday we saw there's a tremendous amount of energy in thermite and in this warehouse, there's a tremendous amount of thermite. So the question for you is, is this in any way dangerous? - it's a fair question. It's a fair question. - they set up this demonstration for me to see how safe thermite is to handle. They want me to try to ignite this full crucible of thermite with increasing sized ignition sources. But i wasn't entirely confident this was a good idea. Maybe you can help me ignite it. - where's christof? Have you tried this by the way? - [christof] no. - well then, under these circumstances, i would get you some safety gear. - [christof] i'm 95% sure that you cannot ignite it. - 95? - there you go. That's safety gear. - that's a one in 20. Is that how we're doing it? This is a fireproof suit. - at least there will be footage how it happened. (laughs) - so first, here's a little lighter. All right, let's give it a shot. See if i can get this to ignite. Three, two, one. I'm making some of the thermite particles here quite hot so that they are actually glowing orange. Oh, oh, oh. it's getting quite bright. Are you getting worried watching that? - no, not getting worried. - i heard you make a noise and i was like, \"no, he's getting worried. I shouldn't keep it on the same spot.\" do you think this whole thing's going to blow up on my face? - [axel] no, i hope not. - so you can see like even getting it- - [axel] glowing hot. - glowing hot, it still won't ignite. All right, let's pull out a bigger torch. I'm going to try with this one. Got a nice big blue flame there. I feel like this is not as hot as the other lighter, so i'm getting a little bit of orange there, but just barely. We're going to have to bring out the big guns. All right, let's torch it in three, two, one. Do you think we can build up enough heat? How hot? - [axel] 500. - did you say 500? - [axel] yeah. - i can see a lot of thermite glowing orange. There's some pieces coming out. - nice and glowing. - [christof] 700. - 700 degrees. I think this is an excellent demonstration that thermite is not going to ignite under normal conditions. Wow. - [axel] there you go. it's still glowing. - [derek] did it melt? - [axel] yeah, that can happen. - it can melt and not- - not ignite. - not ignite. What the. That is absolutely nuts. - obviously, there is a lot of potential energy here, but getting that energy is really, really difficult. So if it would catch a fire and, you know, whatever, the wooden pallets would burn, you would not be able to ignite the thermite. - would not even. - no, it would just sit there and it would just ignore you. - the key to this lack of reactivity is the aluminum powder. - the aluminum is quite stable because it's covered in aluminum oxide, and only if it gets so violently heated that that layer breaks down in a large number of particles, then the reaction can start. - so the aluminum oxide is like the secret stopper of thermite? - [axel] exactly. - the seal. This reaction has a very high activation energy, so it can't be started by a lighter or a propane torch. Okay. This is why we've been using barium hydroxide igniters. Basically, the same stuff that's in sparklers. - [christof] happy new year. - it gets hot enough to break through the aluminum oxide layer and start the reaction. - we want to make sure that the ignition temperature is so high that it can only light it deliberately. Because once it's going. - [derek] i am going to push the button in three, two. - there is no way of stopping it. (thermite explodes) - that is crazy. I was filming in germany for a full five days, so this is just a taste of what's to come. We'll find out how thermite reacts with its environment and we'll have a dedicated video on the most common application of thermite, welding railroad tracks together. There probably will be millions of people watching this video. Most of them have probably ridden on a train. What is the likelihood that they have ridden over one of your thermite welds? They will. - [derek] 100%? - 100%. - [derek] so make sure you're subscribed to be notified about these videos when they come out.",
        "token_count": 6348,
        "link": "https://www.youtube.com/watch?v=cUBz04LlLVk"
    }
}