{
    "ORxKf1FN3ro": {
        "transcript": "You can never see anything enter a black hole imagine you trap your nemesis in a rocket ship and blast him off towards a black hole he looks back at you shaking his fist at a constant rate as he zooms in gravity gets stronger so you would expect him to speed up but that is not what you see instead the rocket ship appears to be slowing down not only that he also appears to be shaking his fist slower and slower that's because from your perspective his time is slowing down at the very instant when he should cross the event horizon the point beyond which not even light can escape he and his rocket ship do not disappear instead they seem to stop frozen in time the light from the spaceship gets dimmer and redder until it completely fades from view",
        "token_count": 149,
        "link": "https://www.youtube.com/watch?v=ORxKf1FN3ro"
    },
    "DJO_9auJhJQ": {
        "transcript": "- arthur c. clarke had a sequel to \"2001, a space odyssey.\" it's called \"2010, odyssey two.\" and at the end of it, an alien intelligence converts jupiter into a star. As a group of astronauts narrowly escape the implosion, they receive the following message from the aliens, \"all these worlds are yours, except europa, attempt no landing there.\" now that was just a novel, but it suggests that already in 1982, we suspected that europa might offer our best chance of finding alien life in the solar system. 42 years later, in october 2024, nasa is actually launching the most advanced mission to hunt for signs of alien life. And it's going to jupiter's moon europa. There's just one problem, jupiter kills everything around it. So how could life exist there? And how do you make a probe that can withstand the perilous conditions? (suspenseful music) (gentle music) deep inside jupiter, there is so much pressure, that hydrogen is believed to take the form of a metallic liquid. And this metallic liquid hydrogen generates an incredibly powerful magnetic field, almost 20,000 times stronger than earth, if you measure at the same distance away. So if you could see this magnetic field from earth, it would appear twice as big as the full moon. On its own, that magnetic field is harmless. But right in the middle of it is the most volcanically active world in the solar system, jupiter's moon, io. The volcanoes on io's surface shoot out tons of sulfur dioxide, and every second, one ton of this material gets ionized and trapped inside jupiter's magnetic field. And the field accelerates these particles to rotate incredibly fast with jupiter. So they whizz around at over 300 kilometers per second. Their inertia actually pulls back on the field, stretching it out. And this trapped material slams into other moons, ejecting even more particles from their surfaces. This cycle forms massive radiation belts which span past europa and the other moons of jupiter. Now, for electronics, this intense radiation is kryptonite. In the 1970s, the pioneer 10 and voyager missions only briefly passed by jupiter, but the radiation caused glitches, gave the instruments false commands, and corrupted some of their data. Even with modern shielding, a spacecraft within the radiation belts would only survive for around three months. So how will nasa's new mission, the europa clipper, orbit europa for over four years without getting fried? Well, the solution is, it won't. It'll orbit jupiter from afar and then swoop in every few weeks to quickly fly by europa and then leave again. And since the mission is going to collect a lot of data, it can use the downtime while it's way out here to transmit it all back to earth before going in for another swoop. In all, it'll do 49 flybys, mapping almost the entire surface. That's actually how the clipper got its name, after the fast and nimble 19th century clipper ships, quickly dipping in and out of ports. But of all the places in the solar system to look for life, why europa? If you stood on europa's surface, you'd be hit with 5,400 millisieverts of radiation in a single day. That's 1,800 times more than the annual dose here on earth. If you stay here for a couple of hours, you would eventually die from radiation sickness. But europa contains a secret. When voyager 1 passed by jupiter in 1979, it took this photo of europa. If you compare it to most of the other moons in the solar system, you'll notice something is missing, craters. Every planet and moon has been bombarded by asteroids over billions of years. And most planetary surfaces show it. But not europa. So why not? Well, something recent, say over the last 60 million years or so, must have been happening on europa to erase most of these craters from the surface. 16 years after voyager, galileo arrived to jupiter. It spent eight years studying both the gas giant and its moons. And galileo's magnetometer picked up something interesting on europa. Jupiter's magnetic poles, like earth's, aren't aligned with its geographic poles. So as the planet rotates every 10 hours, the whole magnetic field wobbles. This changing field from jupiter induces a magnetic field on europa, and a relatively strong one at that. That means there must be an electrically conductive layer within europa that reacts to jupiter's field. And readings from galileo indicate that it must be somewhere close to the surface, only 10s of kilometers deep. So what kind of conductive layer? Well, europa's white surface is almost entirely covered in a thick crust of water ice. These reddish-brown regions, when observed through a spectrometer, fit the description of a lot of things, like hydrated salts, sulfuric acid or even bacteria. We need more data to be sure, but recent experiments at jpl found that sea salt when bombarded with intense radiation, turns from white to this same brownish color found on europa. So scientists suspect that there's a whole saltwater ocean inside europa that could be 100 kilometers deep. Meaning that europa would contain twice as much water as the whole of the earth. And it must driving geological activity that constantly smooths out and renews the surface of the moon. But the jupiter system only gets about 4% of the sunlight we get here on earth. So europa's surface is constantly below -160 deg celsius, so you'd expect the ocean to be frozen solid. But there's a way to generate heat that doesn't rely on the sun. And i've got a little demo here to prove it. Europa's orbit around jupiter isn't a perfect circle. This is because io, europa and ganymede are in orbital resonance. Each time ganymede completes one orbit, europa completes two and io four. Because of that, io tugs europa inward on one side of the orbit, while ganymede pulls it out on the other, making its orbit more eccentric. Now, jupiter's pull is stronger on the closer side of the orbit than on the farther side. So europa is constantly being stretched and squeezed, stretched and squeezed. And you can see how this rubber ball gets warmer as i squeeze it. Scientists believe that the friction caused by the tidal flexing of the entire moon can generate enough heat to keep the ocean liquid. This effect gets stronger the closer you are to jupiter, which is why io is so volcanically active. So you can see this ball is significantly hotter now. I held onto this ball at the same time to make sure that it wasn't just the heat coming in from my hand. What sort of temperature of the ocean are we thinking? - so it depends on how salty it is. So, melting temperature of ice or maybe depressed by 10 degrees celsius below that if it's a very salty ocean. Similar to cold oceans on earth. - and how would the flexing differ if there's this big liquid ocean versus if there's no ocean there? - if there's no ocean, europa should flex by only about one meter in amplitude. But if there's an ocean in there, then it flexes with an amplitude of 30 meters. So that's an enormous deflection. And that will come out pretty clearly in the gravity data. Another argument for how thick the ice shell is, we see these very strange features on the surface that are arcuate in shape, but like multiple arcs put together. We call them cycloids. Not something you'd expect to see on an icy moon. And we think they form if a crack propagates at just the right speed, about the speed someone would walk, and is following the changing stress field of europa being squeezed as it orbits around jupiter. And if there were no ocean down there, there wouldn't be enough of an amplitude of that motion to explain the cracking. But if there is an ocean, then it could explain the cracking. - all that tidal flexing pushes magma in the outer core up, closer to the seafloor. Water flowing through the crust above it is heated and it picks up minerals from the ground, ejecting them into the ocean. This creates hydrothermal vents. And where we find these on earth, we also find life. Thousands of meters below the surface, with no sunlight, these vents are oases for ocean life. The lifeforms down here rely on unique bacteria, bacteria that feed on the minerals from the vents, rather than on the energy provided by the sun. How long are we thinking that europa has had an ocean? - it could be four billion years, we don't know for sure. - that amount of time could give life the opportunity to evolve in those oceans? - right, exactly right. Organisms can use methane, carbon dioxide, sulfur reactions. Any chemical reaction you can think of that might happen in the ocean can potentially be used as a fuel for that organism's metabolism. So we're not talking about searching for fishes, or whales or squids or something down there, but looking for single cell organisms. - we were so concerned there might be life on europa that, when the galileo mission was ending in 2003, it was deliberately crashed into jupiter to avoid the risk of contaminating europa. But clipper will not be able to drill through the kilometers-thick ice crust. So how are we going to find evidence for life beneath that thick surface? This is the snotbot. It's a drone with petri dishes glued to the top, and it flies right through whale blows to collect whale snot right here on earth. And zoologists can use the snotbot to retrieve all sorts of info on a whale's biology. And it turns we can do something very similar for celestial bodies too. We've actually captured images of water geysers shooting out of enceladus, a moon of saturn, housing a subsurface ocean. And the hubble space telescope has picked up some evidence of what could be similar geyser eruptions on europa. The hope is that clipper could fly through one of these plumes, like the snotbot, and reveal their chemical composition using a mass spectrometer. But evidence for an ocean on europa isn't conclusive. Enceladus seems like a stronger candidate, we have actual images of its plumes and we've even flown through them. We are almost 100% certain there's a subsurface ocean there. If we have these plumes on enceladus and there's clearly maybe a liquid ocean there, why does europa have your attention more than enceladus? Is there something that draws you? - we don't know how long it takes life to get going, but it's possible that enceladus may have just kind of started up its engines, whereas europa has more likely been well evolved over a long time. - surprisingly, being bombarded by jupiter's radiation actually makes europa a better candidate. See, those high-speed particles hitting europa's surface give water and carbon dioxide molecules enough energy to form new compounds, like formaldehyde or hydrogen peroxide. And these can serve as food for life beneath the surface, if they can get down that far. - and we have evidence of overturn of the icy shell at chaos zones where the icy crust seems to have collided and material has been shoved into the icy shell. So there may be ways for this fuel for life to get down into the icy shell and potentially to the ocean. - [derek] and clipper doesn't have to touch down on the surface to confirm this. - there's an infrared spectrometer to look at the chemical fingerprints of light bounced off the surface to help identify and map out where the salts are, find if there are organics there. There is an ultraviolet spectrograph that's aboard the spacecraft to look for plumes. Are they there? And of course, then can we fly through them? And then there'll be imaging of essentially the whole globe at better than 100 meters per pixel resolution. So one camera will take swaths of images as we fly over the surface and that's called the wide angle camera. And then the other camera is the narrow angle camera. From 50 kilometers altitude, it will get half meter per pixel images, right? So it'll be able to resolve my desk here if it were on europa. And then it would be a future mission, like a lander that would go and actually search for signs of life on europa. - do you think a lander would have a chance of survival? - there have been studies that say we can get a lander living on the surface for a month. If we think that's sufficient to go in there, scoop some stuff up from below the depth of radiation processing, and put it into a mass spectrometer and see what we see. - but the europa clipper won't be studying jupiter's moons alone. The european space agency's juice mission, or the jupiter icy moon explorer, is already on its way to jupiter. It will come to the system just 15 months after clipper and it'll even be doing a few flybys of europa, before settling into a tight orbit around ganymede. So the european space agency will also have a mission there at the same time? - yes, we're having informal conversations with members of the juice science team. What would it mean to have two spacecraft there at the same time? The juice mission will end up in orbit around ganymede and ganymede has its own magnetosphere. Well, we'll be outside ganymede's magnetosphere. So we might say, \"oh, look, there's this big burst coming from jupiter.\" and then juice might say, \"oh, we felt that over here in our magnetic signals.\" so we wouldn't have to really do anything different except talk to each other and make sure that the sum of the whole is even bigger than its parts. - europa clipper was scheduled to launch on october 10, 2024, but nasa is waiting for hurricane milton to clear florida before the spacecraft can take off safely. When will we get the first results? - you'll start seeing distant observations coming in in 2030 as we look at europa from afar and search for plumes. And then you'll see the first really high resolution data in 2031. - so after say 26 years of thinking about a mission to europa, how does it feel to be so close to launch? - it's a little surreal, (laughs) i must say. This has been such a long time coming. It's occasionally hitting me that our spacecraft is going to be up there in the heavens, right, on its way. It turns out that, during a europa ocean conference in the late 1990s, nasa actually video-called arthur c. clarke. And after showing him plans for a future mission to explore the faraway ocean world, clarke finally gave nasa permission to land on europa. (monitor whooshing) europa clipper is a perfect example of the amazing things we can do when we set ourselves ambitious goals and work together with others to achieve them. But i think we often get wrapped up in our everyday lives and forget just how much of an impact we can make on the world. That's true on a society-wide level, like these big international space missions, but i also think it's true at an individual level. You yourself can probably accomplish much more than you think when it comes to making the world a better place. And today's sponsor, 80,000 hours, wants to help you do just that. They're not selling anything. 80,000 hours is a nonprofit that can help you work out a plan for achieving a big, positive impact in the world, and then executing on it. Career advice typically aims to help you find a job that suits your preferences. But what if you really care about helping the world? Well sure, they can tell you to be a doctor or a teacher, but these aren't your only options. Which is why 80,000 hours have done over 10 years of research into how to find a career that does a lot of good, and also feels satisfying. They have everything from an in-depth career guide, to a podcast on the world's most pressing problems and how we can solve them. They even have a curated job board with hundreds of high-impact career opportunities. And everything they provide is free, forever. So if you want to make a difference with the 80,000 hours you have to shape your career, then sign up now at 80000hours.org/veritasium. There's a link in the description or you can scan this qr code. So, i want to thank 80,000 hours for sponsoring this video, and i want to thank you for watching.",
        "token_count": 3567,
        "link": "https://www.youtube.com/watch?v=DJO_9auJhJQ"
    }
}