{
    "DJO_9auJhJQ": {
        "transcript": "- arthur c. clarke had a sequel to \"2001, a space odyssey.\" it's called \"2010, odyssey two.\" and at the end of it, an alien intelligence converts jupiter into a star. As a group of astronauts narrowly escape the implosion, they receive the following message from the aliens, \"all these worlds are yours, except europa, attempt no landing there.\" now that was just a novel, but it suggests that already in 1982, we suspected that europa might offer our best chance of finding alien life in the solar system. 42 years later, in october 2024, nasa is actually launching the most advanced mission to hunt for signs of alien life. And it's going to jupiter's moon europa. There's just one problem, jupiter kills everything around it. So how could life exist there? And how do you make a probe that can withstand the perilous conditions? (suspenseful music) (gentle music) deep inside jupiter, there is so much pressure, that hydrogen is believed to take the form of a metallic liquid. And this metallic liquid hydrogen generates an incredibly powerful magnetic field, almost 20,000 times stronger than earth, if you measure at the same distance away. So if you could see this magnetic field from earth, it would appear twice as big as the full moon. On its own, that magnetic field is harmless. But right in the middle of it is the most volcanically active world in the solar system, jupiter's moon, io. The volcanoes on io's surface shoot out tons of sulfur dioxide, and every second, one ton of this material gets ionized and trapped inside jupiter's magnetic field. And the field accelerates these particles to rotate incredibly fast with jupiter. So they whizz around at over 300 kilometers per second. Their inertia actually pulls back on the field, stretching it out. And this trapped material slams into other moons, ejecting even more particles from their surfaces. This cycle forms massive radiation belts which span past europa and the other moons of jupiter. Now, for electronics, this intense radiation is kryptonite. In the 1970s, the pioneer 10 and voyager missions only briefly passed by jupiter, but the radiation caused glitches, gave the instruments false commands, and corrupted some of their data. Even with modern shielding, a spacecraft within the radiation belts would only survive for around three months. So how will nasa's new mission, the europa clipper, orbit europa for over four years without getting fried? Well, the solution is, it won't. It'll orbit jupiter from afar and then swoop in every few weeks to quickly fly by europa and then leave again. And since the mission is going to collect a lot of data, it can use the downtime while it's way out here to transmit it all back to earth before going in for another swoop. In all, it'll do 49 flybys, mapping almost the entire surface. That's actually how the clipper got its name, after the fast and nimble 19th century clipper ships, quickly dipping in and out of ports. But of all the places in the solar system to look for life, why europa? If you stood on europa's surface, you'd be hit with 5,400 millisieverts of radiation in a single day. That's 1,800 times more than the annual dose here on earth. If you stay here for a couple of hours, you would eventually die from radiation sickness. But europa contains a secret. When voyager 1 passed by jupiter in 1979, it took this photo of europa. If you compare it to most of the other moons in the solar system, you'll notice something is missing, craters. Every planet and moon has been bombarded by asteroids over billions of years. And most planetary surfaces show it. But not europa. So why not? Well, something recent, say over the last 60 million years or so, must have been happening on europa to erase most of these craters from the surface. 16 years after voyager, galileo arrived to jupiter. It spent eight years studying both the gas giant and its moons. And galileo's magnetometer picked up something interesting on europa. Jupiter's magnetic poles, like earth's, aren't aligned with its geographic poles. So as the planet rotates every 10 hours, the whole magnetic field wobbles. This changing field from jupiter induces a magnetic field on europa, and a relatively strong one at that. That means there must be an electrically conductive layer within europa that reacts to jupiter's field. And readings from galileo indicate that it must be somewhere close to the surface, only 10s of kilometers deep. So what kind of conductive layer? Well, europa's white surface is almost entirely covered in a thick crust of water ice. These reddish-brown regions, when observed through a spectrometer, fit the description of a lot of things, like hydrated salts, sulfuric acid or even bacteria. We need more data to be sure, but recent experiments at jpl found that sea salt when bombarded with intense radiation, turns from white to this same brownish color found on europa. So scientists suspect that there's a whole saltwater ocean inside europa that could be 100 kilometers deep. Meaning that europa would contain twice as much water as the whole of the earth. And it must driving geological activity that constantly smooths out and renews the surface of the moon. But the jupiter system only gets about 4% of the sunlight we get here on earth. So europa's surface is constantly below -160 deg celsius, so you'd expect the ocean to be frozen solid. But there's a way to generate heat that doesn't rely on the sun. And i've got a little demo here to prove it. Europa's orbit around jupiter isn't a perfect circle. This is because io, europa and ganymede are in orbital resonance. Each time ganymede completes one orbit, europa completes two and io four. Because of that, io tugs europa inward on one side of the orbit, while ganymede pulls it out on the other, making its orbit more eccentric. Now, jupiter's pull is stronger on the closer side of the orbit than on the farther side. So europa is constantly being stretched and squeezed, stretched and squeezed. And you can see how this rubber ball gets warmer as i squeeze it. Scientists believe that the friction caused by the tidal flexing of the entire moon can generate enough heat to keep the ocean liquid. This effect gets stronger the closer you are to jupiter, which is why io is so volcanically active. So you can see this ball is significantly hotter now. I held onto this ball at the same time to make sure that it wasn't just the heat coming in from my hand. What sort of temperature of the ocean are we thinking? - so it depends on how salty it is. So, melting temperature of ice or maybe depressed by 10 degrees celsius below that if it's a very salty ocean. Similar to cold oceans on earth. - and how would the flexing differ if there's this big liquid ocean versus if there's no ocean there? - if there's no ocean, europa should flex by only about one meter in amplitude. But if there's an ocean in there, then it flexes with an amplitude of 30 meters. So that's an enormous deflection. And that will come out pretty clearly in the gravity data. Another argument for how thick the ice shell is, we see these very strange features on the surface that are arcuate in shape, but like multiple arcs put together. We call them cycloids. Not something you'd expect to see on an icy moon. And we think they form if a crack propagates at just the right speed, about the speed someone would walk, and is following the changing stress field of europa being squeezed as it orbits around jupiter. And if there were no ocean down there, there wouldn't be enough of an amplitude of that motion to explain the cracking. But if there is an ocean, then it could explain the cracking. - all that tidal flexing pushes magma in the outer core up, closer to the seafloor. Water flowing through the crust above it is heated and it picks up minerals from the ground, ejecting them into the ocean. This creates hydrothermal vents. And where we find these on earth, we also find life. Thousands of meters below the surface, with no sunlight, these vents are oases for ocean life. The lifeforms down here rely on unique bacteria, bacteria that feed on the minerals from the vents, rather than on the energy provided by the sun. How long are we thinking that europa has had an ocean? - it could be four billion years, we don't know for sure. - that amount of time could give life the opportunity to evolve in those oceans? - right, exactly right. Organisms can use methane, carbon dioxide, sulfur reactions. Any chemical reaction you can think of that might happen in the ocean can potentially be used as a fuel for that organism's metabolism. So we're not talking about searching for fishes, or whales or squids or something down there, but looking for single cell organisms. - we were so concerned there might be life on europa that, when the galileo mission was ending in 2003, it was deliberately crashed into jupiter to avoid the risk of contaminating europa. But clipper will not be able to drill through the kilometers-thick ice crust. So how are we going to find evidence for life beneath that thick surface? This is the snotbot. It's a drone with petri dishes glued to the top, and it flies right through whale blows to collect whale snot right here on earth. And zoologists can use the snotbot to retrieve all sorts of info on a whale's biology. And it turns we can do something very similar for celestial bodies too. We've actually captured images of water geysers shooting out of enceladus, a moon of saturn, housing a subsurface ocean. And the hubble space telescope has picked up some evidence of what could be similar geyser eruptions on europa. The hope is that clipper could fly through one of these plumes, like the snotbot, and reveal their chemical composition using a mass spectrometer. But evidence for an ocean on europa isn't conclusive. Enceladus seems like a stronger candidate, we have actual images of its plumes and we've even flown through them. We are almost 100% certain there's a subsurface ocean there. If we have these plumes on enceladus and there's clearly maybe a liquid ocean there, why does europa have your attention more than enceladus? Is there something that draws you? - we don't know how long it takes life to get going, but it's possible that enceladus may have just kind of started up its engines, whereas europa has more likely been well evolved over a long time. - surprisingly, being bombarded by jupiter's radiation actually makes europa a better candidate. See, those high-speed particles hitting europa's surface give water and carbon dioxide molecules enough energy to form new compounds, like formaldehyde or hydrogen peroxide. And these can serve as food for life beneath the surface, if they can get down that far. - and we have evidence of overturn of the icy shell at chaos zones where the icy crust seems to have collided and material has been shoved into the icy shell. So there may be ways for this fuel for life to get down into the icy shell and potentially to the ocean. - [derek] and clipper doesn't have to touch down on the surface to confirm this. - there's an infrared spectrometer to look at the chemical fingerprints of light bounced off the surface to help identify and map out where the salts are, find if there are organics there. There is an ultraviolet spectrograph that's aboard the spacecraft to look for plumes. Are they there? And of course, then can we fly through them? And then there'll be imaging of essentially the whole globe at better than 100 meters per pixel resolution. So one camera will take swaths of images as we fly over the surface and that's called the wide angle camera. And then the other camera is the narrow angle camera. From 50 kilometers altitude, it will get half meter per pixel images, right? So it'll be able to resolve my desk here if it were on europa. And then it would be a future mission, like a lander that would go and actually search for signs of life on europa. - do you think a lander would have a chance of survival? - there have been studies that say we can get a lander living on the surface for a month. If we think that's sufficient to go in there, scoop some stuff up from below the depth of radiation processing, and put it into a mass spectrometer and see what we see. - but the europa clipper won't be studying jupiter's moons alone. The european space agency's juice mission, or the jupiter icy moon explorer, is already on its way to jupiter. It will come to the system just 15 months after clipper and it'll even be doing a few flybys of europa, before settling into a tight orbit around ganymede. So the european space agency will also have a mission there at the same time? - yes, we're having informal conversations with members of the juice science team. What would it mean to have two spacecraft there at the same time? The juice mission will end up in orbit around ganymede and ganymede has its own magnetosphere. Well, we'll be outside ganymede's magnetosphere. So we might say, \"oh, look, there's this big burst coming from jupiter.\" and then juice might say, \"oh, we felt that over here in our magnetic signals.\" so we wouldn't have to really do anything different except talk to each other and make sure that the sum of the whole is even bigger than its parts. - europa clipper was scheduled to launch on october 10, 2024, but nasa is waiting for hurricane milton to clear florida before the spacecraft can take off safely. When will we get the first results? - you'll start seeing distant observations coming in in 2030 as we look at europa from afar and search for plumes. And then you'll see the first really high resolution data in 2031. - so after say 26 years of thinking about a mission to europa, how does it feel to be so close to launch? - it's a little surreal, (laughs) i must say. This has been such a long time coming. It's occasionally hitting me that our spacecraft is going to be up there in the heavens, right, on its way. It turns out that, during a europa ocean conference in the late 1990s, nasa actually video-called arthur c. clarke. And after showing him plans for a future mission to explore the faraway ocean world, clarke finally gave nasa permission to land on europa. (monitor whooshing) europa clipper is a perfect example of the amazing things we can do when we set ourselves ambitious goals and work together with others to achieve them. But i think we often get wrapped up in our everyday lives and forget just how much of an impact we can make on the world. That's true on a society-wide level, like these big international space missions, but i also think it's true at an individual level. You yourself can probably accomplish much more than you think when it comes to making the world a better place. And today's sponsor, 80,000 hours, wants to help you do just that. They're not selling anything. 80,000 hours is a nonprofit that can help you work out a plan for achieving a big, positive impact in the world, and then executing on it. Career advice typically aims to help you find a job that suits your preferences. But what if you really care about helping the world? Well sure, they can tell you to be a doctor or a teacher, but these aren't your only options. Which is why 80,000 hours have done over 10 years of research into how to find a career that does a lot of good, and also feels satisfying. They have everything from an in-depth career guide, to a podcast on the world's most pressing problems and how we can solve them. They even have a curated job board with hundreds of high-impact career opportunities. And everything they provide is free, forever. So if you want to make a difference with the 80,000 hours you have to shape your career, then sign up now at 80000hours.org/veritasium. There's a link in the description or you can scan this qr code. So, i want to thank 80,000 hours for sponsoring this video, and i want to thank you for watching.",
        "token_count": 3567,
        "link": "https://www.youtube.com/watch?v=DJO_9auJhJQ"
    },
    "cUBz04LlLVk": {
        "transcript": "- [derek] this is the first in a series of videos about a chemical reaction discovered over 125 years ago. It releases a tremendous amount of heat. Oh no, the gopro. Liquefying metal. It is so hot. It is not an explosive, but it can cause explosions. That is crazy! But the reactants are so inert, they can withstand a blow torch indefinitely. Do you think this whole thing's going to blow up in my face? In fact, when hollywood directors wanted something that looked like a nuclear bomb, this is the reaction they chose. But in its most common use, one basically unchanged in over a century, it has helped move billions of people all over the world. In the late 1800s, karl and his younger brother, hans goldschmidt, were preparing to join the family business. Their father owned a chemical factory making dyes for fabrics. So they studied chemistry under robert bunsen of bunsen burner fame. After their father's early death, karl took over management of the company, later joined by his younger brother. One of hans' first major research aims was to find a way to produce pure metals. These were essential for making dyes for everything from clothing and tablecloths to wallpaper. At that time, good dyes were hard to come by. Most were faint and faded further after use. Some required the collection of large quantities of exotic insects. These days, we take color for granted, but in this drab world, people would pay handsomely for bright color fast dyes. One such dye was scheele's green, which was chemically copper arsenite. As its name suggests, it was toxic, though exactly how toxic is a matter of debate. Still, it became the dominant green dye by the end of the 19th century because its color was unbeatable. The red color of the british army officer's coats was made from cochineal, a central american insect mixed with tin. The addition of tin made the color darker and more intense. So the demand for pure metals was strong. - they had their experience in purifying metals by dissolving them in solutions or in acids and all kinds of things. - [reporter] the incoming cyanide solution goes on dissolving the particles of gold left in the sand after amalgamation and liquefies it. - and then work with the salts, purify the salts, and then reduce the salts into the metal state. And every step that you would take would then again cause problems, right? Reducing it in a furnace, you have to deal with all the exhaust and the contamination through the carbon. - [derek] and metals are very difficult to separate from each other. - they basically, they form a mixed crystal, right? - like an alloy. - like an alloy, right. They all become, in a sense, one substance that has one melting point, which is why you have to kind of take some steps to separate them. - [derek] so hans came up with a novel idea. He would react a metal oxide like chromium oxide with aluminum metal, and his hope was that the oxygen would swap partners, forming aluminum oxide and pure chromium. This type of reaction is now known as an aluminothermic or thermite reaction. So i have come to visit electro-thermit in germany, a company that is a direct descendant of goldschmidts. I feel like they've set this up like a tour of willy wonka's chocolate factory, but instead it's a thermite factory. Here we are going to try to replicate han's first successful reaction. All experiments in this video were performed under the supervision of professionals taking proper safety precautions. - originally, the first experiment was using chrome, but we are using copper, which is comparable. - [derek] this is like 300 grams. - [axel] yeah, 300 grams of thermite. - pour it in? all right. We pour it into the crucible and ignite. All right. - yeah. - that's it. - yeah. (shouts) - leave it, leave it, leave it. - whoa! (laughs) that is like fireworks. well, that's impressive. - [axel] but you bet he was surprised when he saw that. (both laughing) handful of aluminum powder, and then you get this. - [derek] as you can see, the reaction releases a lot of energy. The temperature of thermite reactions typically exceeds 2,000 degrees celsius, and it can be as much as 2,500. That's because aluminum forms very strong bonds with oxygen. When those bonds form, they release a lot of energy, way more than is required to break the copper oxide bonds we started with. This energy melts all the products of the reaction and makes them glowing hot. It is hard to express just how bright they are. It feels like staring at the sun. If you see clips in this video where the highlights are overexposed, it's because it is so hard to judge how bright the reaction will be, and it's almost always brighter than you expect. So that dropping down the bottom there, is that liquid copper? - [axel] that's liquid copper and basically the solution that was being created. - [derek] but if you get this hot mixture of pure metal and aluminum oxide, how do you separate the two materials to isolate the pure metal? We're trying to set up an experiment that no one has ever seen before and it's actually going to allow us to see inside the crucible. We cut the crucible in half and we're attaching two pieces of thermally resistant glass, each four millimeters thick, as a window into the reaction. People said this would be impossible, that you wouldn't be able to see anything or that the glass would just break. - we've never done this on camera and really seen it this way, this clear. And i think it's going to be fascinating to then start to analyze and make sense of this. - now this glass has been specially treated, so it shouldn't shatter immediately when it comes into contact with molten metal. Ah, that is hot. that is really hot. But the melting temperature of silica is around 1,700 degrees celsius, which is definitely lower than the temperature of the reaction, so the glass certainly will melt. The hope is it melts slowly enough to contain the reaction. - the glass will melt and at the end, we have just a very thin layer of the glass at the end. So you will ignite it. it's up to you to place the igniter. - i think someone else should ignite it. I think someone else should ignite it. - [christof] why? - because i don't trust myself. We saw how incapable i was of igniting yesterday. That's it? (shouts) - leave it, leave it, leave it. - [derek] for this reaction, we'll be using iron thermite, so a combination of iron oxide and aluminum metal. Okay, that's good. let's do this. Holy. Oh no, the gopro. Oh boy. Oh no. Oh no. That's the end of the gopro. The reaction starts at the igniter and expands outwards in all directions. To me, it almost looks like ants or mold or something. It looks organic in how it's sort of spreading. You see a pulse. boom, boom, boom. - [christof] it's living. - yeah, that's what it looks like. Why is there pulsing? - i don't know. - okay. - we try to understand. - huh. - we never knew that it did that. We do this for 100 years and and suddenly you find out, you know, every portion that gets ignited does that. - do you think that's gas escaping up and that's almost what causes the pulsing? Like some gas heats up and then it shoots up and then it makes space for the next one? That's what you seem to see over here. - [christof] yeah. - wow, that is hot. that is really hot. I wanted to get a closer look, so i asked them to put some thermite on top of glass, and then i would shoot from below using this probe lens. - i'm ready. - okay, we're rolling. It's rolling, it's rolling, it's rolling, it's rolling, it's rolling. There it goes, there it goes, there it goes, there it goes, there it goes, there it goes. Wow! yeah! The exposure's pretty good. Oh my goodness. incredible. This is the closest i think anyone's ever filmed a thermite reaction. You can see that the reaction proceeds in bursts, it reacts fast, but then pauses for a moment before advancing again. - should i take it? - sure. Yeah, take it, take it, take it, take it, take it, take it, take it, take it, take it, take it, take it. Oh boy. I have two ideas about why this might be. First, there might is a mixture of grains, big particles of aluminum and iron oxide, and they need to be present in the right ratio to react efficiently. Maybe a little pocket reacts out to where the ratio is slightly less ideal until the heat builds up enough to trigger the reaction in the next pocket. My second idea is that in between the grains, there is air. The reaction heats the air, which expands, increasing the pressure between the grains and possibly pushing some of the unreactive material away from the reaction front. So once that air escapes, the next patch can ignite. Once all the thermite has reacted, things get really violent. Molten metal is ejected out of the top of the crucible, and inside, the liquid is sloshing around. This could be due to some of the materials boiling, actually turning from liquid into a gas. Now, i know it sounds wild to think about metals boiling, but the boiling point of aluminum is around 2,500 celsius. Iron boils above 2,800 celsius, and there are other elements in the mixture like manganese that boil at just 2,000 celsius. Now, once that boiling stops, the liquid settles down, and now comes the key to making pure metal. The density of liquid iron is more than twice that of liquid aluminum oxide. So iron settles to the bottom as aluminum oxide floats to the top. Now, when the metal melts through the bottom of the crucible, the first liquid to pour out is iron. Only after it has drained does the aluminum oxide or slag follow. You can actually see the change from iron to aluminum oxide. Liquid iron has a viscosity like water, so you can see it coming out there and splashing. And then the slag starts right there. Yeah, it comes out smooth. - [christof] really, really cool. - whoa. - [christof] and this is more like warm honey. - [[derek] yeah, you can totally see it. Wow. It definitely gives you a sense of being right there. And you can see the flames coming off the front. And it still records. Look at the bubbles on the glass. You see those bubbles? And that beautiful shot of the iron pouring out. I mean, this is impressive work for a camera that's on fire. We're going to put a cobblestone, normal street paver inside here. It's made of limestone. We'll pour the thermite on top and then ignite it. And then we'll see that the cobblestone is less dense. Then that solution, it's going to come up to the surface. - yeah. - whoa. okay. It looks like it's breaking into pieces. That's a good bit of lava. - [axel] did you see it? - oh yes. Ordinary rocks like cobblestones rise to the surface, just like the slag, as the denser metal drops to the bottom. And this is key to producing high purity metal in the crucible. So hans goldschmidt had developed a process to make pure metals like chromium, copper, and iron. This could be great for chemistry in making dyes, but hans suspected it could have even broader applications. He patented the process in 1895 and wrote it up for publication. He wrote, \"the procedure that i have here is in its principle so extraordinarily simple that i could hardly have undertaken the time to present, if not for its surprising and extraordinary effects.\" thermite was a solution looking for problems. One of the first applications of thermite was to weld metal parts in remote locations. - wherever you need a very, very strong, very reliable weld and kind of a remote area where you don't have the luxury of bringing, you know, tons of equipment and tons of welding gear, that is useful for thermite. You know, some of the first customers were in fact shipping companies. When some shaft would break in the middle of the ocean, at the time, you would be lost. And now having like thermite to be able to at least fix that in some way that would get you home was actually very useful. It was being able to fix something or to fix cracks in engine blocks and to be super mobile with it, because you know, like we said, it takes two guys and the bucket. - of course, in this case, the iron thermite would actually not produce pure iron, but rather steel. This was done by including carbon and other alloying elements in the thermite powder. - nobody needs pure iron. pure iron is actually useless. It's very soft, it corrodes immediately even in dry air, and nobody will want that, right? - you need iron with some carbon in it. - exactly right. You need iron with some carbon, that makes it a steel. - so the majority of thermite produced today is steel thermite. - you have this steel mill that you can, you know, move wherever you want it to have. After the end of the cold war, we would use thermite basically to destroy, say gun barrels from tanks. Basically you have a portion of thermite that you basically stick into the gun barrel and then you would ignite it and then it would basically weld the gun barrel and destroy it and it would be completely useless afterwards. Those are all kinds of weapons or stuff that were not useful anymore that we use thermite to destroy because it's very quick and it's very safe. - and it's very final. - and it's very final. Once you've put that in, there is absolutely no way of making use of that weapon again. - a modern application of thermite is to use the heat generated to destroy information. Past a certain temperature, the curie temperature, magnets lose their magnetism. So information stored on magnetic hard drives at high enough temperatures becomes unrecoverable. This looks like a very different form of thermite. - yes. - i'm used to seeing it as a powder. - before it was also powder and we dry it. - can i pick it up or? - yes. - i mean, it's like a normal piece of tile. - yeah, lay it down. - whoa. (laughs) that's amazing. That is cool. So if we want to make sure no one can read the information on this hard drive, i could put this on top? - yeah. - there you go. When we ignite the crucible, we have this high temperature for a short moment. And here we have it for 10 minutes, so everything is destroyed. - so you're controlling the energy release to make it slower here. - yes. the temperature's not so high, and reaction is slower. - i am going to light this thermite tile in all four corners, and it's going to generate heat for about 10 minutes, and we'll see what it does to this laptop. All right, let's light it. Ooh, i like this. See how it's oozing? whoa. It's a totally different effect. Whoa. Yeah, that's getting hot. It's getting to the laptop now. this is really cool. Like you got to see the molten goo coming out from underneath that laptop. That is wild. After seeing so much thermite, this is a totally different version of it. Look at the puddle of metal there. Oh. Yeah, nobody's getting any data off that laptop. That is awesome. I did not expect to see the logo in thermite. Can i lift it? - [christof] of course. (both laughing) - i've never destroyed data like this before, but every time i get a spam call, i wish i could just magically make the records of my phone number disappear. Fortunately, today's sponsor incogni can help. Now, i used to get several spam calls a day, which frustrated me so much that i contemplated making a video where i would just mess with these spam callers to get a small amount of revenge. But ever since i started using incogni back in april, i no longer have to because they solve this problem for me. You see, there are a lot of data brokers out there that collect all sorts of different information about you, like your name, phone number, email address, and even your social security number. And then they sell this information on the open market, which is why you can get calls from people who you've never even given your number to. But incogni battles these data brokers. You simply give incogni permission and they figure out who has your data. And then they know which laws apply, and so they can send the right letter with the correct legal terms to each data broker with the request to remove your information. What i love about incogni is that it's super easy to use and it actually works, and it saved me a ton of time. So far, they filled out 192 requests on my behalf, 145 of which have been completed, saving me over 108 hours of work. And it just keeps running in the background, continuously protecting me against these data brokers. The best part is that since i've signed up, i've hardly gotten any more spam calls. So to try incogni and fight against the data brokers, visit incogni.com/veritasium. Click that link down in the description or scan the qr code right here. And make sure to use the code veritasium to get 60% off the annual subscription. Head over to incogni.com/veritasium to get started yourself. So i want to thank incogni for sponsoring this part of the video, and now back to thermite. Now you might think, given the amount of energy given off that thermite could be used as an explosive, but it's actually not well suited for that purpose. - what makes thermite so interesting and so important is that you can control it so well. If you have an explosion, you can kind of calculate the energy really well and say it's, you know, x amount of megajoules that you get out, but it's really hard to say over what time. - maybe one of the reasons why this is not explosive is because when you have explosive reactions, typically your reactants are solid and the products are gases, which obviously expand a lot and create a lot of pressure. But in this case, both the reactants and products are solids? - they're solids and liquids. - yeah, right. You have so much control over what's going on. - woo. i feel like i got a sunburn from that. This property makes it possible to take down structures where explosives would cause too much damage. In 1933, 4 weeks after adolf hitler became the chancellor of germany, the reichstag building in berlin was set on fire and it would only be fully repaired 24 years later. But the burnt out steel dome had lost its structural integrity and needed to be removed. Now, conventional explosives would've caused irreparable damage to the rest of the old building. So on november 22nd, 1957, thermite charges were strapped to the dome and when ignited, they melted through the steel, which fell neatly into the former plenary hall below, allowing the repairs to be completed. Applications like this are possible because the thermite reaction can be carefully controlled. They have the ingredients so dialed in that you can actually ignite thermite indoors without fear of molten metal flying all over the place. This mixture includes some pieces of pure steel. They don't participate in the reaction, but they do absorb heat as they melt. So they help control the rate of reaction and the temperature reached. - [axel] there you go. - all right. - that's it. - that's it? - yes. - i don't think it was in. oh boy. Whoa. Wow. - it's interesting, like looking at it through dark glasses, it looks like a cornbread muffin or something. One of the really important parameters to control is how long after the reaction starts does the metal start flowing out the bottom of the crucible. This is known as the tap time. It's critical because if the tap time is too short, the metal inside doesn't fully separate from the slag. But if the tap time is too long, then the metal dissolves more silica from the walls of the crucible and it also comes out colder than it could have been. - so the chemistry of the steel actually changes over the time. - the longer it stays in there. - exactly. The log it stays in there, and this is why it's very important for us to be able to control how long it actually stays there. - you want the tap time to be somewhere in the middle, just right. We've set up this experiment here to test. Can we control the time when the steel comes out? So the idea is it should come out of this one first, then this one, then that one. We're going to ignite all three simultaneously and see what happens. - you good? 3, 2, 1. Yes. They all ignited at almost exactly the same time, but the top time of the first crucible, we got one, was by far the shortest. Two. It'd be amazing if this one stops and the third one goes, like that would be very, very impressive. Come on, third one. wow. That's great. that's fantastic. Another attribute that can be controlled is the temperature of the metal. - here we have two different versions. So we have a version with 12% damping, and here we have with 25. - sometimes you want the metal to come out a little hotter or a little colder. There we go. nicely controlled ignition. Well, that one goes a lot more. wow. You could see the 12% one went first. Whoa! You can see that, you know, this one starts first, so you can get a bit of a sense, but i feel like both of them reached 2,000. I don't know. - the one on the right side is one of the less dampened portions, and the other one is one of the more dampened ones. We could dramatically change the temperatures in both directions, a little bit higher and significantly lower. - [derek] all of this control is achieved by carefully adjusting the thermite mixture. - this is the starting point of the making of thermite. About once or twice a day a truck comes and drops in this. This is mill scale. So this is basically a mixture of different iron oxides. When you hot roll steel, the surface of the steel is very reactive because it's so hot and there is so much water involved to cool the rollers, so that the surface actually oxidizes very quickly and creates this mill scale. And then they use like water jets to blow it off the steel surface. And for the rolling mill, this is just a waste product, right? - [derek] whoa. - [axel] there you go. - that is cool. - the mill scale from outside comes in here and then gets dried because thermite and water, they're not exactly friends and you want the mill scale to be as dry as possible and then stay dry, so this is how we dry it. - the iron oxide is shaken up the spiral ramp to the top floor, and there, the particles are separated into different sizes and compositions before being mixed with aluminum powder. This also has to be very dry, i imagine. - it's not as much a problem here because the way that it's being manufactured doesn't contain any water. With the iron oxide, it's getting blown off with the water jets. We have to control all the elements, the reactive elements, which is the iron oxide and the aluminum to make sure that every portion has their very defined reactivity. And then we get the reaction that we want and also the chemical qualities in the steel that we want. - you guys use this word portion. - portion, yeah. that's the word that we use. A portion is basically one bag of thermite. - no cameras. - [cameraman] always breaking the rules, this guy. - [derek] so the portions are bagged up individually and stored in the warehouse. - this is our warehouse, but this is only one of them. And this is not even the biggest. - can i ask you one question here? Okay, yesterday we saw there's a tremendous amount of energy in thermite and in this warehouse, there's a tremendous amount of thermite. So the question for you is, is this in any way dangerous? - it's a fair question. It's a fair question. - they set up this demonstration for me to see how safe thermite is to handle. They want me to try to ignite this full crucible of thermite with increasing sized ignition sources. But i wasn't entirely confident this was a good idea. Maybe you can help me ignite it. - where's christof? Have you tried this by the way? - [christof] no. - well then, under these circumstances, i would get you some safety gear. - [christof] i'm 95% sure that you cannot ignite it. - 95? - there you go. That's safety gear. - that's a one in 20. Is that how we're doing it? This is a fireproof suit. - at least there will be footage how it happened. (laughs) - so first, here's a little lighter. All right, let's give it a shot. See if i can get this to ignite. Three, two, one. I'm making some of the thermite particles here quite hot so that they are actually glowing orange. Oh, oh, oh. it's getting quite bright. Are you getting worried watching that? - no, not getting worried. - i heard you make a noise and i was like, \"no, he's getting worried. I shouldn't keep it on the same spot.\" do you think this whole thing's going to blow up on my face? - [axel] no, i hope not. - so you can see like even getting it- - [axel] glowing hot. - glowing hot, it still won't ignite. All right, let's pull out a bigger torch. I'm going to try with this one. Got a nice big blue flame there. I feel like this is not as hot as the other lighter, so i'm getting a little bit of orange there, but just barely. We're going to have to bring out the big guns. All right, let's torch it in three, two, one. Do you think we can build up enough heat? How hot? - [axel] 500. - did you say 500? - [axel] yeah. - i can see a lot of thermite glowing orange. There's some pieces coming out. - nice and glowing. - [christof] 700. - 700 degrees. I think this is an excellent demonstration that thermite is not going to ignite under normal conditions. Wow. - [axel] there you go. it's still glowing. - [derek] did it melt? - [axel] yeah, that can happen. - it can melt and not- - not ignite. - not ignite. What the. That is absolutely nuts. - obviously, there is a lot of potential energy here, but getting that energy is really, really difficult. So if it would catch a fire and, you know, whatever, the wooden pallets would burn, you would not be able to ignite the thermite. - would not even. - no, it would just sit there and it would just ignore you. - the key to this lack of reactivity is the aluminum powder. - the aluminum is quite stable because it's covered in aluminum oxide, and only if it gets so violently heated that that layer breaks down in a large number of particles, then the reaction can start. - so the aluminum oxide is like the secret stopper of thermite? - [axel] exactly. - the seal. This reaction has a very high activation energy, so it can't be started by a lighter or a propane torch. Okay. This is why we've been using barium hydroxide igniters. Basically, the same stuff that's in sparklers. - [christof] happy new year. - it gets hot enough to break through the aluminum oxide layer and start the reaction. - we want to make sure that the ignition temperature is so high that it can only light it deliberately. Because once it's going. - [derek] i am going to push the button in three, two. - there is no way of stopping it. (thermite explodes) - that is crazy. I was filming in germany for a full five days, so this is just a taste of what's to come. We'll find out how thermite reacts with its environment and we'll have a dedicated video on the most common application of thermite, welding railroad tracks together. There probably will be millions of people watching this video. Most of them have probably ridden on a train. What is the likelihood that they have ridden over one of your thermite welds? They will. - [derek] 100%? - 100%. - [derek] so make sure you're subscribed to be notified about these videos when they come out.",
        "token_count": 6348,
        "link": "https://www.youtube.com/watch?v=cUBz04LlLVk"
    },
    "w5ebcowAJD8": {
        "transcript": "- when qr codes first came out, i thought they were awful, never going to catch on. This is a flow chart from the time that really resonated with me. The problem as i saw it was that qr codes are ugly, and they mean nothing to people. I would rather just see a website or a word that i could google. Qr codes are a language for machines, and i am a human. But i was wrong. Qr codes obviously turned out to be so useful that they are now ubiquitous, used in everything from tickets to restaurant menus and advertising. In some countries, they're the most common way to exchange money. And the story of qr codes is a very human one. The origin of these checkerboard patterns actually dates back to our first efforts at digitizing information. In 1825, there was a renowned painter who lived in new haven, connecticut, with his wife and two kids. His big break came one day when he was invited to paint a portrait of the marquis de lafayette, a hero of the american revolution. Even though his wife was expecting their third child any day, the opportunity was too good to pass up, and he hastily set off for washington dc where lafayette was waiting. There the painter wrote to his wife describing his first meeting with lafayette, signing off with the words, \"will write again soon. Love to all the children. In the greatest haste, but with the same ardent affection as ever, thy loving husband.\" after a few days with no reply, a courier delivered a letter which said his wife was ill after childbirth. Worried, the painter rushed home. He traveled by horse and wagon, day and night, managing to arrive back in new haven in several days. (melancholic music) but it was far too late. His wife had died. Not only that, he had missed the funeral. Her body was already buried in the ground. The painter's name was samuel finley breese morse. (inquisitive music) from that day forward, morse set out to find a faster way to communicate over long distances. He got a job at new york university where he attended lectures on electricity, a rapidly developing field at the time. In 1836, along with joseph henry and alfred vail, he devised a machine that could send electrical pulses along a wire. This was not the first electric telegraph, but it was the simplest. In the uk, another team had set up a series of circuits to move five magnetic needles to point at letters and numbers. Morse's system required only a single circuit, but the simplicity of the apparatus demanded a cleverer method of encoding information. On the circuit, you could send short or long pulses. Morse turned these into dots and dashes. The most common letters could be sent with a single key press, a dot for an e and a dash for a t. The other letters were arranged by frequency and assigned increasingly complex codes. These symbols were meant to be printed at the receiver on a paper strip, but operators soon realized they could recognize the letters just by the sound. (morse code beeping) this sped up the rate at which information could be sent and received, so morse code became an international standard for rapid messaging. (morse code rapidly beeping) widely used in the military, maritime communications, and aviation, the universally recognized distress call, sos, what does it stand for? Nothing, it just happens to be easy to send and recognize in morse code. Morse code revolutionized communication, but in the next century, it would transform a totally different industry. (mellow jazz music) in the late 1940s, bernard silver was an engineering student at drexel university in pennsylvania. One day, he overheard the president of a local supermarket chain asking the engineering dean to find a way to speed up the checkout process. At that time, cashiers had to type in each item and its price by hand. A process so tedious and repetitive that many cashiers had developed carpal tunnel syndrome. Silver told his friend norman joseph woodland about the problem, and together, they began experimenting. After several false starts, woodland moved down to florida. And one day on the beach, he drew some dots and dashes of morse code in the sand, something he was very familiar with as a boy scout. He recalls, \"i just extended the dots and dashes downwards and made narrow lines and wide lines out of them,\" and thus the first barcode was created. From this humble beginning, evolved the universal product code or upc barcode, capable of storing a simple string of 12 numbers. It's read by scanning a laser across it and checking how much light is reflected to read the black and white lines, essentially as dots and dashes. A pair of vertical lines are placed at the beginning, middle, and end to ensure the scanner reads the code properly. The code is divided into left and right halves. Numbers at either side have their black and white lines flipped so that the scanner can tell left and right apart, even while reading upside down. When viewed upright, the numbers typically specify the manufacturer on the left and the product on the right. Manufacturers actually pay large sums of money to reserve a given amount of numbers to themselves so that they can exclusively register their products. (scanner beeps) in this way, the 12 digits of a barcode uniquely specify every single grocery item you've ever bought. This jar of jif peanut butter is identified by the same 12 digits no matter where in the world it's found. And all forms of peanut butter, smooth, crunchy, stir, no-stir, sugar-free, low-sodium across all brands get their own unique barcode. Will we ever run out of barcodes? Well, 12 digits could combine to provide 10 to the 12, that is a trillion different possible sequences. That should be more than enough, even if companies keep making stuff like sour patch oreos and flaming hot mountain dew. But there is a catch. The last digit is not independent of the others. The barcode creators were aware that it could get scratched, stained, or tampered with, so they reserved the last digit to verify that the barcode is complete. Take any barcode and sum the digits at odd-numbered positions, multiply this result by three, add the digit sum at even-numbered positions to the result, and take the remainder when this number is divided by 10. If this remainder is zero, then the check digit is zero. Otherwise, the check digit is 10 minus this remainder. (bright electronic music) if a scanner is unable to read any one digit of the barcode, it can use the final digit to back-calculate what it must be using this algorithm. But if two digits are damaged, well, then we're out of luck. In that case, we have to type in the numbers printed below the barcode. So without that last digit, the number of unique possibilities is 10 to the 11 or 100 billion options. To date, 1.24 billion barcodes have been registered, a number that is rising every day, so they won't last us forever. (scanner beeping) but that's not why people began to look for alternatives to barcodes. It was really the amount of information a single barcode could store. 12 digits by themselves could only identify one product. But what if someone wanted to know more information, like where that product came from? (brooding music) in 1986, cattle in the uk began showing symptoms of a curious brain disease, bovine spongiform encephalopathy, or mad cow disease for short. It is spread when cattle ate feed containing prions, misfolded proteins, and if people ate beef containing tissue from the brain or spinal cord of infected cattle, they could contract a related brain illness that literally turns your brain into a sponge. Now, as no test could detect mad cow disease in living cows, millions of cattle were culled. Health officials sought a method to track sources in imports of beef. But with all the information this would require for any one piece of beef, barcodes were insufficient. American inventor david allais tried to solve the problem by stacking many barcodes on top of each other. The result, code 49, looked like a bookshelf. This is actually the predecessor of pdf417, a code often used on airline boarding passes. But code 49 didn't solve the data quantity problem. At best, it multiplied the information a barcode could carry by a handful. A more efficient way was to extend barcodes into two dimensions, creating a data matrix. Nasa tried this in 1994 with vericode, used to track and identify space shuttle parts. This code was read by early digital cameras rather than lasers and was initially proprietary. Around the same time, masahiro hara, an engineer at a japanese auto parts manufacturer, denso, was getting frustrated at having to scan multiple barcodes for filling in the same box of car components. - hara set out to develop an alternative on his own. He took inspiration from an unusual source. - to understand how information is stored in a qr code, i am going to build one myself in the way masahiro hara first conceptualized it, with a go board. I have the usual black and white stones. White represents zero. black represents one. And we're going to encode the link to our youtube channel on this board. So the first step is to convert www.youtube.com/veritasium into ones and zeros, and we'll do that using byte encoding. By encoding uses ascii, which itself has roots in morse code. Every character is assigned a number from 1 to 256. Then we convert the ascii decimal into its binary form. Since 256 is 2 to the power of 8, we can use the eight binary bit combinations to represent all ascii characters. These eight bits make up one byte of information. (upbeat techno music) the letter w is assigned the ascii decimal 119 or 01110111. Doing the same for all characters in www.youtube.com/veritasium, this is what the string looks like in binary. This is 26 characters long, so it takes up 26 bytes of information. Now, our board is 25 by 25. This is known as a version 2 qr code, but there are many different sizes, all readable by your phone. Hara's version 1 qr code was 21 by 21, and the largest version today is 177 by 177. That is large enough to hold three kilobytes of information. Just 26 of these would've been enough to store all the information apollo 11's computer needed to send humans to the moon. (bright music) one programmer (mattkc) even coded up a computer game, snake, into a version 40 qr code. (bright music) the region around a qr code must be empty and of uniform color. This is the quiet zone. A distinguishing feature of qr codes is the three square patterns in the corners. These position squares allow the reader to identify the orientation of the code. Now, almost all qr codes also have a fourth square in the last corner, but it's smaller and, hence, trickier to spot. This is the alignment pattern. It's used to rescale the qr code when it's read from varying distances or from crazy oblique angles. The relative size and distance of the alignment square with respect to the position squares allows the software to rescale it into a proper square. Next to the position squares are plain white strips that isolate them from the rest of the code. And these are timing strips, zebra pedestrian crossings which connect the top left position square with the other two. Every qr code has these alternating strips. You should look out for them. Qr codes of all sizes visibly look the same, so this tells your phone which version it is and, therefore, how much data to expect. If there are five alternating squares, it's version one. If there are nine, it's version two, and so on. And next to those are format strips that contain rules for how to scan the code. I'm placing red stones in the space they occupy for now. There is another feature every qr code has. This one pixel adjacent to the bottom right position square, it is always dark. I asked hara-san if it had any special significance, but he said no. All of this remaining space is for data storage. Data inside a qr code always starts at the bottom right corner. Here, the first four squares carry four bits that specify the data format: 0001 if it's just numbers; 0010 if it's alphanumeric, so capital letters and numbers; 0100 if it's information stored in bytes; and 1000 for japanese kanji. The following eight bits are used to indicate the number of characters in our message. So since we have 26 characters, that should be 00011010. Next, we start arranging our bytes for youtube.com/veritasium starting in eight-bit, two-column cells;. They follow a zigzag pattern that snakes its way to the top left. Within each cell that represents a byte, the most significant bit, corresponding to two to the seven, is at the bottom right. And the least significant, or two to the zero, is at the opposite end. 01110111 for w will hence be filled like this. And we'll follow along with the rest. Once we fill in the bytes for www.you, we encounter the alignment pattern after four bits. To put in the next t, we simply bypass it and do the same for any of the other fixed regions of the code. Thus, we keep filling in our data in the same zigzag pattern. After we complete www.youtube.c, the cells start looking less regular and more tetris-like. But the way we put the stones byte after byte remains the same. (hopeful music) and there go the last eight bits for the last letter m. But wait a minute, we've only covered about half of our qr code. Well, that's because this whole remaining space is reserved for redundancy. These extra bytes of error-correction code allow us to reconstruct information if the qr code is damaged. (menu whooshing) for a fully intact qr code, error correction makes something else possible, putting a company logo at the center, just like the sponsor of this video, saily. Now, i travel a lot. Recently, i was in germany. Right now, i'm in australia, and soon, i'm going to the uk. But wherever you are, you need to have a working phone. Either you pay your home carrier's hefty roaming fees, or you have to find a place to buy a local sim card, put it in the phone, and hope it works. This video's sponsor saily makes it easy to set up a cell plan and data in more than 150 countries. You can pick how much data you want and how long you want it for. And it is so much cheaper than roaming. I'm actually going to the uk really soon, and here's how quickly i can set up an e-sim with saily. All i have to do is click on the country, select a plan, and activate the e-sim. Then when i land, i'll automatically connect to a local network with no hidden charges. That's it. there's no need to hunt for public wifi. And you don't have to stand in line at the airport to get a physical sim. With saily, you set it up once, and you'll always be connected. And if you find out that your phone isn't compatible with e-sims, you will get a full refund. So to check out saily for free, go to saily.com/veritasium or click the link in the description. Use the code veritasium to get an exclusive 15% off your first purchase. That's saily.com/veritasium, or you can scan this handy qr code to get 15% off. So i wanna thank saily for sponsoring this part of the video, and now back to building our own qr code. (playful music) qr codes offer four levels of error correction: low, which can still be read with 7% of the code missing; medium, which can handle 14%; quartile, 25%; and high, up to 30%. This means a qr code could still be read properly, even with nearly 1/3 of it missing. Higher levels require more space for error correction. So knowing how much of the code is error correction is vital. This information is protected in two ways. First, the level of error correction is indicated in the format strip, which is present identically in two places. The simplest way to avoid errors is to duplicate the information. Here we'll choose the m level by placing one blue and one yellow stone here at the top left. So what if this part gets damaged? We have a copy in the second format strip starting at the bottom left. The format strip contains three more bits of important information that we'll get to later. So for now, i'm just gonna put down three blue stones in both copies. But what about all the rest of the format strip? Well, this is the second layer of protection. These other 10 bits are all just designed to correct mistakes in the first five bits. So how does this work? Let's say i only wanted to communicate two levels of error correction to you, low or high. If one of the bits flips in transmission to 01 or 10, it's easy to know that an error has occurred, but no way to know which the original message was. An easy way to fix this is to add another bit. So 000 for low, 111 for high. Now, these are at opposite ends of a cube, and hence, they are further apart. If you then receive 011, it's more likely that the intended message was 111, so it's easy to correct. In this scheme, the only allowed code words are 000 and 111. The rest act as disallowed buffers to indicate errors in transmission. The allowed code words should be as far apart as possible. Here, they are three vertices apart. This is known as the hamming distance, after richard hamming who pioneered the field of error correction. For a hamming distance of n, you can correct up to n - 1 over 2 errors in a binary string, so one bit flip in the previous example. So back to the five bits of our format string. If i only wanted to communicate all zeros or all ones, i could place them at opposite corners of a five-dimensional hypercube. However, our string includes all 2 to the 5, or 32, combinations of ones and zeros as valid code words. So to provide buffers like before, we can extend the 5-bit string into a 15-bit string. And now the 32 valid code words are each separated by seven vertices, or a hamming distance of seven, which means we can correct up to three bit flip errors. The easiest way to do this is using a lookup table. The table takes a slightly misread vertex and finds the closest valid vertex, likely the intended code word. But for our main qr code data, we need a far more efficient scheme, one that doesn't require lookup tables or doubling or tripling our data size. (bright music) let's say i wanna send you a message that is the four numbers 1, -2, 3 and 5. If i just send these numbers, one of them could get corrupted in transmission, and you wouldn't know that an error had occurred or which digit was wrong. So before i send the message, we come up with a plan. First, instead of sending you four numbers, i will send six. The first four are my actual message, and the last two, a and b, will help you check if there were any errors. Now, i want you to treat these six numbers as the coefficients of a degree-five polynomial, and i will pick the values of a and b so that this polynomial could also be written in the form of a degree-three polynomial, call it q of x, times (x - 1)(x - 2). Now, we could set these last two terms to be x minus any number, but for simplicity, let's say we pick one and two. That way, when you receive my polynomial, you know that if you plug in x = 1 or x = 2, you should get zero for both because that's how i constructed the polynomial. And if you don't get zero, you know there has been an error in transmission. They are called syndromes. Which is an apt term since syndromes are defined as a group of signs that occur together and characterize a particular abnormality. If the message polynomial is not 0 at any of the syndrome values then there is an error in the code. So how do i find the values of 'a' and 'b' in our example? Well, i take the polynomial without 'a' and 'b' and divide it by x - 1, x - 2. I get a degree-three polynomial, which is what i want, but there is also a remainder of 37x - 30. So i can move this to the left-hand side. For the polynomial to take the form i want, 'a' must be negative 37 and 'b' positive 30. So i send the message 1, -2, 3, 5, - 37, and 30. You can plug in x = 1 and x = 2, and if you get zero for both, you know the message was sent correctly. But what if there was an error in transmission? Say at position four, the number has changed to a six. Well, now if you evaluate at x = 1 and 2, the polynomial is no longer zero. To figure out where the error occurred, one at a time, you set each coefficient to be a variable. Then find the value of that variable, setting the polynomial equal to 0 at x = 1. You repeat this for x = 2. And what you find is that the two values are different. This indicates that the second coefficient was not the error. You find the same for all the other coefficients, except when you reach the one where the error occurred. Here, not only are the two values equal, they're also equal to the originally transmitted number. That is, five. So this method allows us both to check and correct errors with only a modest increase in data size. (inquisitive music) this is a toy example of a reed-solomon error correcting code, developed by mathematicians irving s. reed and gustav solomon in 1960. (upbeat music) (qr code whooshing) the job of decoding reed-solomon codes in a brute-force way, as we described, can quickly get intensive. In fact, as the voyager spacecraft floated into the outer solar system, nasa engineers knew their signal-to-noise ratio would get incredibly small. But the promise of reed-solomon codes was such that they put an experimental encoder in before launch, wagering that that smarter encoding algorithms would follow in the next decade. And that's exactly what happened. To this day, we can make out voyager's ever-faintening whispers, thanks to reed-solomon codes. These codes also ensure that your old cds or dvds can still play your favorite songs and movies despite multiple scratches. And they are the reason why qr codes still work when damaged. In a qr code, the entire data, starting from the data type, character length byte, our message bytes, and final padding, are laid out in a line and converted back into ascii decimals. Fitting a high-degree polynomial using these can easily make the coefficients blow up. Hence, reed-solomon encoding uses finite-field arithmetic, galois fields, to obtain the error correcting terms. These, converted back into binary, are used to fill out the rest of the qr code. (bright music) and there we have our complete qr code. But why can't we scan it yet? See how these regions here appear uniformly white and black? Well, sometimes the encoded data can insert plain patterns and blank spaces just by chance. These can confound the readers which expect to see a noisy checkerboard. They think maybe it's a big damage patch, or maybe it's not a qr code at all. But there is a way to fix this. Remember the three blue stones i put in for masking in the format string? Well, they specify one of eight ways to reshuffle the appearance of our qr code pixels to make them seem truly jumbled. Now, this particular mask says, flip the pixels so white becomes black and black becomes white for every third column of data. But this does not apply to the functional elements of the code. They remain unchanged. (bars whooshing) (qr code beeping) the qr code standard specifies the use of eight masking patterns. In principle, when combined with the correct masking bits, all eight forms of the code are readable, which is why some qr code generators will return different looking codes for the same input string. But which one works best? Well, every continuous or bad patch adds points, and each mask gets assigned a score. The mask with the lowest score at the end wins. It's easiest for any reader to scan. (confetti cannon pops) (audience applauds) for our handmade qr code, i'm going to use the simplest mask. And now we have a working qr code. Try it out. (bright music) and moment of truth. - ahh, it worked. You know, going through this exercise made me realize again why i hate qr codes. They're not meant for people. I made all kinds of mistakes while i was trying to put down these black and white stones. This was really hard to get this perfect. I guess it didn't have to be perfect, but it had to be close enough, all right. Initially, qr codes had only industrial uses. But it wasn't long before the value of their data storage capacity was realized. In 2002, mad cow disease resurfaced in the uk. 179 people died from eating contaminated beef, and people panicked. They wanted to know exactly where their meat was coming from and how it was stored before it reached the supermarket. This time, the qr code was available to help. It was one of the first instances where the curious checkerboards started to appear in common use. But why are qr codes so successful? There are plenty of other 2d matrix codes out there. Well, one reason is that denso wave decided not to exercise patent rights on qr codes. We made the patent open to everyone, which made the qr code so popular. Denso instead opted to monetize and sell qr code scanners. Of course, with the rise of smartphones, most people would soon carry a qr code scanner in their pocket. But initially, qr code reading apps were third-party and rather niche. But then in 2017, android and apple built qr code readers right into their camera apps, so the use of these codes took off. The covid-19 pandemic also gave qr codes a boost worldwide. Suddenly, restaurants and vendors wanted a contactless way to hand out menus and product information. Contactless payment using qr codes took off in india and china. Today, india sees over 12 billion qr code-enabled transactions per month. Qr codes also proved handy in storing vaccine records and personal health information in phone wallets. But their enormous spread has also created problems. A question about qr code safety: in recent years, some scammers have used qr codes to try to defraud people who read them. Do you have concerns about these uses? So as with anything on the internet, you have to pay extra attention to safety. Check where a scanned qr code is taking you before actually clicking on a link. So i wanna know about the future of qr codes. What is next for qr codes? Now, if the possibility of running out of upc barcodes is remote, for qr codes, it is impossible. The number of unique version 1 qr codes using the lowest redundancy level is 2 to the 152. This is about 10 times the total number of legal chessboard configurations, which is also why a random distribution of pixels filled into a qr code pattern generally cannot be interpreted as a message. You have scanned countless qr codes, and when you scan your next one, you'll have a better idea of how it works. But have you ever thought about what qr itself stands for? What is your favorite application of the qr code? (space tones beeping)",
        "token_count": 5980,
        "link": "https://www.youtube.com/watch?v=w5ebcowAJD8"
    },
    "wVyu7NB7W6Y": {
        "transcript": "- this is linus from linus tech tips and we hacked the phone network in order to spy on him. - that's pretty messed up derek. I slept easier not knowing that. - we intercepted his phone calls and stole his two-factor passcodes. Is that your number linus? - yeah, but i didn't get, mine didn't even ring. - we didn't touch his phone. We didn't send him an email or a text, nothing. We did it all remotely and the worst part is it could happen to you. - i think i'm really surprised that, no offense, but like you guys did it. (derek laughing) well, you're not a career criminal hacker mastermind, necessarily. - no, indeed. - but here it is, a normal looking and feeling device with no, you know, obvious problem with it and you just receive my call instead of me receiving it. Just what, like on command? You just, it's an app on your computer or what? I don't even know. - but before we explain how we did all that, (upbeat music) (crowd clapping) the first startup that steve jobs and steve wozniak made wasn't apple? No, they were tackling a different problem. One where their product was actually illegal. So back in the 1970s, long distance phone calls were really expensive. Adjusted for inflation, a call from new york to london could run you $25 a minute. So these two entrepreneurs created a little blue box and what it did was it hacked the telephone network. They could trick the telephone company into connecting the calls for free among other things. - we were young and what we learned was that we could build something ourselves that could control billions of dollars worth of infrastructure in the world. I don't think there would've ever been an apple computer had there not been blue box. - [interviewer] woz said you called the pope. - yeah, we did call the pope. Woz pretended to be henry kissinger and we got the number of the vatican and we called the pope and they started waking people up in the hierarchy, you know, i don't know, cardinals and they actually sent someone to wake up the pope when finally we just burst out laughing and they realized that we weren't henry kissinger. - but how were they able to do all of this with one electronic box made from radio shack parts? (telephone ringing) until the mid-1920s, most phones had no way of dialing. When your phone was on the hook, about 48 volts was connected from the exchange to your phone. Then when you lifted the receiver, an internal circuit connected the speaker and microphone drawing power and that caused the voltage to drop to around 10 volts. And at the telephone exchange this drop turned on a light bulb alerting the operator who would then pick up and ask who you're calling. - [sarah] boston. - sarah, get me the bluebird diner. - and after consulting a directory, they would connect a wire between your line and your friends. Manually connecting calls was labor intensive. Operators had to handle hundreds of connections per hour. In 1910, one pundit said, \"soon the telephone system will need to employ every working age woman in the country as an operator.\" by 1950, there were more than a million of them in the us alone. To reduce costs, companies sought to automate the call connection process and one solution was the rotary dial telephone. To use it, you place your finger in a number hole, rotate it to the end and the dial rotates back and on the inside a metal disc with ridge's turns, each ridge pushes two metal plates into contact completing the circuit to the exchange. The dial sends pulses to match each number. For the number two, it sends two pulses. For the number three it sends three pulses. This goes on up to 10 pulses for the number zero, which is why zero is at the far end of the dial instead of beside the one. Those pulses that travel down the phone line, they determine how your line is connected. So they're known as control signals, but as the length of the transmission line was increased, so did its capacitance and resistance and this caused the clear input signals to become distorted, smoothing out voltage changes. So now the pulses couldn't trigger the switching at the exchange. While this wasn't a problem for local calls, it made automating long distance almost impossible. Now all phone lines including long distance ones were built to carry sounds in the human voice and hearing range, mainly from 300 to 3,400 hertz. So why not use this built-in capability to carry control signals. To do this, phone companies introduced the touch tone or push button telephone. On a keypad, specific frequencies were assigned to the horizontal axis and the vertical axis so that each button was uniquely identifiable by the combination of two tones. (buttons beeping) by sending control signals within the voice band, all telephone networks could receive it using their existing systems independent of distance. But with this innovation came an opportunity for jobs and wozniak to exploit. When you made a long distance call, it was first routed to a central node. This node communicated with a remote node and they determined if a line was free, by checking whether both sides were sending a 2600 hertz tone. So jobs and woz exploited this. First, they would dial a toll free 1-800 number which would get them into a local node and then they would send a 2600 hertz tone into the phone. This would trick the remote node into thinking the call had been disconnected. So the remote node would start playing the 2600 hertz tone again, but jobs and woz were still on the line. And when they stopped playing the tone on their side, the remote node assumed a new call was being placed. By sending a key pulse tone followed by the desired phone number and ending with a start tone, they could connect to any long distance number for free as the home node still believed it was connected to a toll-free number. The vulnerabilities in the signaling system were obvious to mimic the 2600 hertz tone. Some people would even use a toy whistle from a cap'n crunch cereal box. It just happened to make that frequency. (whistle blowing) the telephone companies clearly needed to develop a new signaling protocol and their solution was to use a separate digital line for carrying control signals. That way no one could control the network by sending tones down the voice line because it no longer controlled how the call was connected. This new protocol was called signaling system no. 7 or ss7 for short. And it's still broadly in use today, but it may not be as secure as people thought. - hello, my name is latifa al maktoum. I was born- - princess latifa of dubai claimed that her father sheikh mohammed, the ruling emir had held her in solitary confinement in the dark, beaten and sedated for several years. In late february, 2018, her finnish martial arts instructor tiina helped her escape. They fled to a yacht captain by former french intelligence officer, herv jaubert. And for eight days they sailed toward india. Latifa was hopeful but it wasn't to last. Late on the night of march 4th a dark boat pulled up alongside it was sent by her father. Laser cites pierced the smoke as agents boarded the yacht, abducting latifa and taking her back to dubai. But how did they find her? Well the captain had been the victim of a coordinated ss7 attack, one aiming to pinpoint his location and by extension the whereabouts of the princess. And i'm going to show you how using the exact same steps to spy on my friends with their permission of course. This is karsten nohl and alexandre de oliveira. They are cybersecurity specialists who are helping me spy on linus. We took three steps to spy on him. First you have to infiltrate ss7, second gain trust and third attack. Of course, the main reason any of this is possible is step one. When ss7 was introduced in 1980, mobile phones barely existed. They were so big that they were mainly just used as car phones but things changed quickly and the number of mobile phones in the world exploded. - roaming is one of the main use cases of ss7. Say derek, you visit me over here. Your phone would try to connect to a network that's foreign and that network would then have to reach out to your home network in australia asking, is this a valid customer? Are you willing to pay for the charges that they'll incur on my network? And all of that information is exchanged over ss7. - for this to work, telcos need to communicate with each other. So the way they do that is by making sure they're part of the same club. The way they share membership to this club is by using unique addresses to identify where requests are coming from. - ss7 is a global network, just like the internet and like on the internet you need some addressing scheme. So you need some way of saying this is me and this is you. And on the internet we use ip addresses. On ss7 we use what's called global titles, gts. - [derek] so to provide global roaming coverage, telcos typically establish agreements with two providers in each country they serve. One primary and one backup. Telcos generally accept messages only from global titles with which they have agreements. And the whole system is designed to be a closed network with few barriers once inside, this is known as the walled garden approach. So this system seems pretty secure and it was. When ss7 was developed in the '80s, the telecommunications landscape was dominated by a few large reputable operators. These operators had established relationships and mutual interest in maintaining the integrity of the network. But 45 years on the landscape has shifted dramatically. Now there are over 1200 operators and 4,500 networks, many of which need ss7 access from virtual network operators to mass-text services sending uber eats notifications. There are so many more players in the garden that not all of them are trustworthy. - those companies, some of them sell services onto third parties, some of them can be bribed, some of them can be hacked. So there's probably thousands of ways into ss7 at reasonable effort or cost. - how much are we talking like how much would it cost to buy access to ss7? - buying a single ss7 connection isn't that expensive? We're talking a few thousand dollars per month. - the people who do sell access, i mean, why would they do it? - people sell ss7 for one reason money. - and thanks to global agreements between providers accessing a trusted gt is like gaining access to all the gts they have partnerships with. We even saw the invoice of a valuable us-based gt being leased illegally for $13,000 a month. Are you buying access to ss7? - i'm paying for access to ss7. yes. And we do that because we do ss7 security tests. So we need to be in a similar position as real hackers to get near real results. - so step one, infiltrate ss7 is complete. Onto step two, gain trust. Hackers today can try many different things once they've scaled the wall into the garden. But you need more than just ss7 access and a phone number to attack. Even a trusted gt and the phone number of the target isn't enough to uniquely identify them. Now you need something from the sim card. The real key in a mobile network is a unique 15 digit identifier which belongs exclusively to the sim card on the phone. It's called an international mobile subscriber identity or imsi for short. And it is very important. - basically to be able to collect the imsi from a subscriber, we would launch some of the messages such as send routing info or send routing info for sm. These messages are normally used to collect the imsi. - networks have firewalls in place that will deny some requests if they look suspicious. Getting an imsi is crucial to appear trusted. So let's move on to the critical step three, attack. Do you wanna just like try the phone? Is there anything you can try to see if it works? Like call someone. - sure. - [derek] or text someone? - sure. i'll call my wife. - she normally pick up. - yeah, she'll probably pick up. - [yvonne] hello? - hello yvonne, this is the voice of your husband. I would like to talk to you about the payment. - okay, thanks. - no, no, it's me. it's me.(laughs) - did she hang up on you? - yeah, yeah, she did. So we've established the phone works as a completely normal phone. - do you have any important calls coming up? - i don't know if i'd say it's important, but i'm on my way to creator summit tonight and james from hacksmith was gonna call me when we're gonna kind of make some plans. (phone rings) - i'm getting a call right now. are you getting a call? - no. - hello, this is linus. - [james] hey linas, it's james. how's it going? - it's going really well. how are you? - [james] pretty good. am i gonna see the youtube summit? - yes, i'm really looking forward to that. And man, do i hate macs? So i feel like that's your persona man. You can't game on a mac. linus, you wanna talk? - i would like to talk but i never got the call, so... - what number did you dial? - [james] 4473.(beep) - is that your number, linus? - yeah, but i didn't get, mine didn't even ring. I heard it ring but i heard it through my speakers on my computer. 'cause i assume it went to your phone then. - that's right. - [linas] or did it go to your computer? - no. yeah, it went to everything of mine. So yeah, james, i don't know. You called linus and it went to me. Thank you for taking part in this weird demonstration. - there is absolutely nothing here to indicate that i was supposed to receive a call. - yeah, and i mean the crazy thing is that's like a regular canadian sim card in there. So any canadian sim card in theory could be vulnerable to such an attack where you know, someone dials your number and it just doesn't go to you. - this is like phreaking but on a completely different level. - that's exactly it. - now i'm familiar already with the concept of sim swapping where you social engineer a way to get a sim that is registered to someone else's account. We've actually had accounts stolen that way in the past, but in this case my phone still works. - [yvonne] hello? - hey, so the demo we're doing is pretty trippy hun. Basically they had hacksmith call me, my phone didn't ring at all and instead derek from veritasium picked up the phone call and was able to talk to him and hacksmith had no idea that he called me and then- - [yvonne] sorry, i'm with cindy. - oh. oh, hi cindy. - [yvonne] oh, you're not on speaker. - okay, that's fine. just tell cindy hi for me. - [yvonne] okay. Okay, goodbye. - [derek] so how are we able to seize control of linus number like that? - when you put a phone number in your address book, you often don't put the country code, but then if you're in a roaming scenario, that phone number would connect to a completely different person in the country you're currently in. So it does make sense to basically overrule people's choices as to whom they're trying to dial because they're not gonna triple check each time whether the address book entries have country codes in them. - this is a powerful function by tricking the network into thinking his phone is roaming, we can rewrite the number he is calling to a number that we control. - and so what i did at the end was when i received this message, i sent back your number that you can see here was your us based number. So even if you were located in australia, i was still able to forward the call to you on your us number in australia. - that's amazing. You just try a few times and then it works, right? - yes, it's not always that simple,(laughs) but this time it was quite difficult. - so the most important question i have now then is what did you need to steal from me in order to become me? Like is this something you can social engineer out of my carrier? Is this something that i would need to accidentally leak a screenshot of my imei. - at the very simplest, all we would need is your phone number. That's it. You could even do something where i could act as a middleman where i would reroute the call to me, but also simultaneously i would dial for you the real number and i would send you through to them and then i can sit on the line and just record that call. - yikes. - but this isn't the only attack. We can do a lot more with ss7. We can also intercept text messages as part of our suite of attacks. Similar to phone calls, we can trick the network into thinking the target is roaming, which reroutes their messages to our gt. We can then steal one time passwords used in two factor authentication. This type of attack works until the subscriber interacts with their phone network, at which point the phone reconnects to the correct gt. - but you need a few seconds only to hack into somebody's account. Of course you need that few second window to receive the one time password. - so we actually set up a new linus youtube channel. - okay, so theoretically he could get this username and password via a dump because i'm a butthead and i use the same username and password across different accounts or he could install a key logger on my system. He could get it that way when i'm typing it in. So then i verify my number. But of course he has my number because that's realistically not that hard to find. And theoretically i'm supposed to get a two factor code right now except... - i got it, 820299, i'm in. - [linas] he's in. he hacked the mainframe. wild hey. - yep, we could hack your youtube account. I'm gonna put, i'm gonna start posting science videos on linus tech tips. - oh, that's okay. I'm sure they'll get like 30 million views or whatever. So i'll be fine with it. thanks for the adsense (derek laughing) - [derek] deal. And you could see the code right there. - [alexandre] exactly. So you could see that at the at the bottom. 820299. So basically once the interception is running, then i would receive any sms sent. - he would never have known that he missed those messages or that they were intercepts. - exact, exact. - wow. yeah, this seems pretty serious. I mean, sms two-factor authentication is almost the default, right? - unfortunately, yes, it's not only the default but in some cases it is the only available option and sometimes that can even be for accounts that should be treated with the utmost of care like a bank account. - [derek] there's a third method of attack that we weren't able to show linus. Lucky for him, his network blocked the requests. On many networks, you can use the imsi number in the switching center info we harvested in step two to send a command deeper into the network. By targeting the switching center where the device with the imsi is connected, we can issue a command routinely used for legitimate purposes such as routing and forwarding calls or providing emergency services based on the device's location. Using this request we can track a target's location. It's not as hard as you'd think. Ss7 doesn't even rely on gps to locate someone. In fact, it was invented before gps was even in public use. One way to do this is if a target is in range of multiple cell towers, their location can be narrowed down to where the signals overlap. The more towers in range, the more precise the location. A more accurate method measures the time it takes for signals to reach a phone from three towers. By calculating the distance based on transmission speed, we can pinpoint an exact location on a 2d plane, but ss7 attacks don't use either of these methods. They try to be subtle. An ss7 location request simply identifies the cell tower the target is connected to. In an urban area with many towers, this can place them to within a hundred meters. - you'll definitely know which city block somebody is in and if you wanted to, for instance find out was it at home and or at work, this is a great way to do it. - yeah, it's a little bit scary. In 2016, karsten and his team used this method to track us congressman ted lieu. - the congressman has been in california, more specifically the la area. Let's zoom in here a little bit. - so that is how we did it. we executed three steps. We infiltrated ss7, gained trust and attacked. We intercepted linus phone calls and text messages. I'm not sure he was as excited about it as i was. - this is why we can't have nice things. - up until now, this has just been a bit of fun. I've demonstrated these attacks on a friend of mine, but the threats are real and they can have devastating consequences. \"they will kill her.\" the captain texted shortly before latifa was abducted. His phone was the target of an ss7 attack that involved all three of the steps we explored. To start, the attackers had leased multiple gts in different countries then the following all happened in a five minute window. First they sent at least seven separate requests aiming to get the captain's imsi from his us based operator. When that didn't seem to work, they followed up with at least four location requests. So did it work? Well, all of these requests were blocked by firewalls. That's why we have all the details. But there was a sixth gt we haven't shown. This one nearby in the us, we have no information about the requests on this gt because they likely weren't stopped. We spoke with crofton black, the investigative journalist who revealed the ss7 exploits in this story and this is what he told us. \"it's a brilliant example of ss7 involvement because it illustrates a classic sophisticated pattern of attack, multiple gts and multiple countries. It's a textbook example of telco penetration risks.\" though, because the emiratis were also using other software like pegasus and other hardware like spotter planes. We can't say that any single one of these was the thing that led to her being found. But the evidence is damning and ss7 is used pretty widely. Criminals have used ss7 to intercept sms two-factor authentication codes and empty millions of dollars from bank accounts. For some ss7 is just the first step. The nso group, a notorious israeli cyber surveillance firm acquired an ss7 tracking company in 2014. Nso is the company behind pegasus, a spyware tool that gains complete access to targeted phones without a user clicking anything embedding itself and erasing traces of entry. Such zero click hacks are costly. They can cost more than $4 million per exploit. Before nso commits resources targeting specific software or vulnerabilities on a phone, first they gather basic data like device type and software version to make their lives easier. And as you've seen with ss7, this isn't hard. One expert we spoke to tested a foreign network and found 20 to 30 vips were constantly under surveillance there, including the country's chief of cybersecurity. Accurate data on tracking is difficult to come by, but another expert provided evidence of more than two and a half million tracking attempts per year. Though they reminded us that the people being targeted are generally those of interest to state agencies. Now we couldn't find data on interception attempts, but luckily experts told us this is far less common. So millions of malicious ss7 requests are sent each year, but it used to be even worse. To request location over ss7, you used to be able to send a command without even knowing the imsi and the network would just provide it to you. No questions asked. - the classical example is the anytime interrogation request, which as the name already suggest is have a creepy command. I don't believe there's ever legitimate purpose for one network to send this command to another network interrogating about their customers. - [derek] karsten nohl and fellow security researcher tobias engel exposed these vulnerabilities publicly in 2014. - the ss7 research that was disclosed in 2014 was a wake up call to the industry. Most people had heard rumors that ss7 tracking and spying was possible, but they hadn't really seen hard evidence of it and especially how easy it is that ragtag gang of hackers from berlin with very amateur means can do any type of ss7 hacking that they want. - [derek] after their conference, all of the german telcos immediately started refusing these requests. - anytime integration is the first ss7 command, everyone stopped because it was abused a lot and never used constructively. But there is over 150 other messages that need to be stopped as well to make ss7 be completely secure. - so if there are so many ways to abuse ss7, why haven't we gotten rid of it? Well, because it's the backbone of 2g and 3g communications. So what if we phase out 2g and 3g? Well, that has caused problems. Since 2018 cars in the eu are equipped with mandatory emergency call buttons that trigger in an accident. They need a sim card to work and to cut costs, guess what auto manufacturers are using. That's right. 2g and 3g sim cards using ss7. - you have to have that legacy support or when 4g connectivity drops, you have absolutely nothing left. Dude, the number of times that i'm on 3g, not insignificant. And i'm in a metropolitan area. - what's surprising, of course, is that there hasn't been a global push yet to replace ss7 with one of the two newer versions of the technology. The latest of which that was introduced with 5g seems pretty secure, but that's now a problem of first mover disadvantage. So because of the network effects you get nothing out of adopting a technology as the first guy. You wanna be the last one when everyone else is already connected and you get the full benefit from also joining the club. - [derek] so even though the 5g signaling protocol can stop the attacks completely and many networks are using 5g technology on their networks, when routing calls between networks, ss7 is still the de facto standard. - you create a tremendous amount of inertia to use a term that's probably more your channel than my channel. That makes moving on extremely difficult. - so unless there are some new major events that put this back on the public radar, it could be another 10, 15, maybe even 20 years until ss7 networks are finally switched off. - what's crazy is that we exploited these vulnerabilities and i'm just a youtuber. I did have the help of some excellent security researchers, but i'm surprised at how easy it all is. Now imagine if i had the backing of a government. This is a real problem. So what can you do to protect yourself on the personal side as long as you have a sim card? Unfortunately there's not much you can do about location tracking. If possible, choose alternatives to sms based two-factor authentication. So messages can't be intercepted. Use an authenticator app or hardware tokens. And if you're worried about phone tapping, use encrypted internet based calling services like signal or whatsapp. We've been told this is mainly used on people of interest. So should it really matter to you? - ss7 is a huge privacy intrusion and there's this millions of abuse cases every single month. Whether privacy intrusion is a problem for individually, of course as almost a philosophical question, right? Somebody who grew up more in the berlin tradition of the chaos computer club like myself, strongly beliefs that privacy and the ability to kind of form your own thoughts without being observed is a prerequisite for democracy. But many other people would argue nothing to hide, nothing to fear. (scrappy music) - our technological world will never be perfect. By the time we secure or replace ss7, vulnerabilities will already have been found in the new system, but luckily there's an easy way to be ready for whatever the future holds, build your knowledge and problem solving skills a little bit every day. And you can start doing that right now for free with this video sponsor, brilliant. Brilliant has thousands of interactive lessons where you can learn by doing, making you a better thinker and problem solver. You build real skills in everything from math and data analysis to technology and programming. You name it. Brilliant, is designed to be uniquely effective. Their first principles approach helps you build understanding from the ground up. So you'll not only gain knowledge of key concepts, you'll learn to apply them to real world situations all while building your intuition, giving you the tools to solve whatever problems come your way. Brilliant's new course on data clustering, for example, equips you with the same tools, security researchers like karsten used to spot trends among the billions of ss7 messages. This is really helpful when hunting hackers, but the concepts you'll learn also help navigating a world where data influences everything, from what movies are being recommended to national politics. And one of the best things about brilliant is since every lesson is bite sized, you can build your skills and sharpen your mind whenever and wherever you have a few minutes helping you build a daily learning habit that sticks the opposite of mindless scrolling. To try everything brilliant has to offer for free for 30 days, visit brilliant.org/veritasium or you can scan the qr code or click that link in the description. You'll also get 20% off an annual premium subscription. So i wanna thank brilliant for sponsoring this video and i wanna thank you for watching.",
        "token_count": 6422,
        "link": "https://www.youtube.com/watch?v=wVyu7NB7W6Y"
    }
}