{
    "84zS-q4evTk": {
        "transcript": "- just a quick note, i am exploring my own relationship with food, eating, and dieting in this video. If you're facing personal challenges or need medical or nutritional advice, please consult a healthcare professional. It's the middle of the day, and i haven't had a proper meal yet. I know that's not good, but what ends up happening is i overthink every single one of my meals 'cause i want them to be delicious and perfect, but when mealtime actually comes around, i end up being super unprepared. So i'll either, one, skip meals, which is physically exhausting, or i'll end up ordering takeout, which is financially exhausting, and i can't afford to keep doing this. So to figure it out, i ate according to the national food guide, looked into the history of how it was made, and finally, fixed my eating habits. - how are you making certain food choices? How do you determine what's enough? - thank you to trainwell for sponsoring a portion of today's video and tour patrons for supporting the channel. I'm trying to figure out how to eat more regularly and healthily, and i know i can't trust myself to plan my meals every single day because i'm too lazy to do that. So, what i need is some sort of loose guideline to help me figure out which foods i should be buying so that i could figure it out from there. Luckily, the government literally makes that for me. This is the canadian food guide from 2007. According to it, every day, i should be eating 7 to 8 servings of fruits and veggies, 6 to 7 servings of grain products, two servings of milk and alternatives, and two servings of meat and alternatives. I know this one's old, but it's what i remember being taught as a kid. In the fourth grade, we had this assignment where we needed to track all of the foods we ate for a week and share it with the class. It was supposed to help us build healthy eating habits, but instead, i think it scarred me more than it helped me. I remember being eight years old and stressed out trying to remember every chewy bar that i ate that week, but i was a child then, and now i'm an adult, so i think it'll be better. I will admit, as i was filling my shopping cart, it did occur to me that this is going to be a lot of food to consume in one week, but let's just go for it. Starting the day off strong with a stocked fridge, i made myself a granola and yogurt bowl, but quickly realized that my yogurt was in fact expired. So i gave up and went up to get a latte and a croissant. I am counting this as a serving of dairy and grains. Now, since it was the weekend, i decided to be a little more ambitious with my lunch. Can't believe i bought this gigantic bag of spinach. I didn't realize that it was as big when i picked it up. I was like, \"oh yeah, this is normal.\" and then i tried to put it in my fridge. (gentle music) and it ended up being worth the wait because it was very delicious. Proportion wise, i think i got this down. I really don't know if i can eat all these noodles. This is just so much noodle. When dinnertime rolled around, i didn't feel hungry for the meal that i originally planned, so i just ended up eating instant ramen. In an attempt to redeem myself, i made myself a generous breakfast. I've been trying to get two servings of grains at every meal because i need like 6 to 7 every single day. This is a lot of bread to be eating this early in the morning. Yeah, i can't finish it, i'm sorry. (gentle music) it was around four o'clock that i realized that i hadn't eaten lunch yet. Honestly, i was still so full from breakfast, but i knew that i needed to eat something for lunch if i wanted to meet my serving requirements for the day. Making this lunch took more effort than i thought, but it was so delicious and i am glad that i ate. Because i ate so late, i thought i'd get by the rest of the night with a little sweet treat. But around 11:00 pm i was taken over by hunger and i knew that i needed to eat something before going to bed. A big reason that i'm doing this in the first place is to have more energy throughout my day. Yes, saving money on takeout, cooking more, and getting my work done as part of this. But a bigger motivation is that i have a dog now and she requires a lot of my energy. I love her. She's the sweetest dog ever. She also happens to be a small chonk. I wanna be able to keep up with her puppy energy and also be able to pick her up in case anything happens. I know that being healthy is part diet, but also part exercise. So i started to work out with the help of trainwell. In the past, working out involves a lot of winging it for the most part, from trying workout classes to influencer bodybuilding programs, i've never felt the motivation to stay consistent or had the feeling like i was doing the right thing. So when trainwell came knocking, i was intrigued because i'd never worked with a personal trainer. One-on-one, and here's how it went. First, i got matched with the virtual trainer after doing a quiz. And yes, this is a real person. - it's nice to meet you. - who worked with me to understand my goals and develop a custom routine for me that worked with my schedule and what i have. For me, that was wanting to work out three times a week for no more than 45 minutes a session and be able to do them at home with two 10-pound weights and a workout mat. It's all done through this app where you can access your workouts, chat with your trainer and track your progress. Your workouts are continuously adapted and are designed to make you enjoy working out. I realized a lot of the classes and programs that i was doing were probably fine, but they weren't modified for my current abilities. So when it came to strength training, we went at my own pace and worked up to lifting heavier over the course of nine weeks. We started with a full body routine, then tried a pilates-vibe routine, which is what i was used to. And currently i'm working on the second iteration of a more conditioning style workout routine. Strength training with trainwell has made me appreciate the value of taking my time and just showing up rather than worrying about having everything being perfect. The weekly motivational messages from olivia also really helped. I remember the exact moment i was able to do a full pushup, not modified mid routine, and i goodly messaged my trainer to share my big win. I can confidently say that trainwell has made me want to work out and i feel better, and i'm really excited to continue. So if you're interested in trying trainwell out for yourself, the first 100 people to sign up using my trainwell link will get 14 days free plus $25 off your first month. Okay, i'm hungry now. By three, i started to notice that i have been eating and cooking more, but i was still struggling to hit all the servings in each food group every day. I thought maybe i wasn't used to eating this much or maybe i was eating the wrong things. But i do know that eating like this wasn't making me feel good. I felt that it was gonna be the two servings of dairy every single day that was gonna get me, but it was actually the sheer amount of bread and grains it was suggesting me to have every single day. This just a little bit too much right now. So i decided to take a break from eating according to the food guide to see what else was out there. I remember hearing about intuitive eating a while ago, which is an approach to eating that focuses on listening to your body to tell you what you need. So i was curious to see if that might solve my problem. And while reading the book, i came across an intuitive eating assessment. So let's take the assessment together. I try to avoid certain foods high in fat, carbs, or calories. I'm gonna say no. I follow eating rules or a diet plans that dictate what, when, and or how to eat. Again, no, i think this is mostly just me eating off of vibes. Okay, question six is, i trust my body to tell me when to stop eating. I feel like, actually no, for that question. After taking the intuitive eating assessment, i was really surprised to learn that i actually don't have great intuition when it comes to eating. Specifically in one section i scored low in was the section on emotional eating, and it made me realize that oftentimes i choose to eat for emotional reasons rather than for physical nourishment. Yes, i can tell when i'm hungry, whether i act on it is a different story. Taking this assessment made me realize that intuitive eating probably isn't the best solution for me right now because it's too loose of a structure and i can't trust myself to eat strictly off of vibes. But at the same time, the 2007 food guide was just way too rigid. Still looking for some guidance. I returned to the food guide and turns out even the food guide recognizes that it has a problem because they came out with a new shiny version in 2019 that looks very different. We use a plate here instead of a rainbow, but something else that i noticed apart from booting dairy off the food guide is a significant reduction in the amount of grains. To understand how the food guide got to this point, i went to the library and dove into the history of the food guide dating all the way back to 1942. We can see just how much it's changed over the years, but let's take a look at the different factors that forced it to evolve. Well, 1942 marks canada's first official food rules, and it outlined the minimum daily food requirements for the average adult. During wartime, the government needed healthy working-class people and recognized that having a well-nourished population would help with that. So they set out these food rules to ensure a healthy, but more importantly, able working class of people. Fast forward to 1961, canada replaces the use of the word \"food rules,\" with \"food guide.\" and expanded the food groups to be more comprehensive, but truthfully, not much actually changed other than reducing the emphasis on liver. However, by 1977, our knowledge of nutrition had greatly improved to follow through on that 1961 goal of making food groups more inclusive. Instead of just meat, we had meat and alternatives. Instead of bread and cereal, we had grains. This knowledge became the foundation of the modern food guide, and it largely came from two major studies. One, a massive survey conducted across the country that helped inform this iteration, but also it came from these malnourishment experiments on indigenous children in the 1940s and 50s. These experiments took place at canada's residential schools. An institution that took indigenous children from their homes in an attempt to assimilate them into canadian society. Here, children's access to food was limited, so as an experiment, they used some of the children as a control group to create a baseline for what malnourishment looks like. Yes, this means that the canadian government intentionally starved indigenous children for the sake of an experiment. Up until now, the food guide was a document that was used to help prevent poor health rather than achieve optimal health. But that started to shift in 1992, where the recommendations took a more total diet approach versus the minimum diet approach of the past, and it finally recognized people's varying energy needs. There weren't any fundamental changes to the 2007 version, but it was the first to recognize milk and alternatives, which brings us here. 2019, a food guide with no dairy, no strict serving suggestions, and a significant reduction in the amount of grains. I think this is the biggest, and might i say, best evolution of the food guide for a couple of reasons. Having a plate and ratios of each food group is so much easier to understand than this. And two, our understanding of nutrition has really improved over the past a hundred years. If we look at all the different food groups, we have fruits and vegetables being the largest one, then we have just a section on proteins, not specific to meat, beans or fish or dairy even. And the grain section has gotten so much smaller because of the emphasis on whole grains and more nutrient-dense grains versus so many slices of bread. But the last thing that i think is the biggest shift in this food guide is the reduction of industry lobbying. This has been confirmed by this paper published by the canadian government that says there is evidence that the bio-food industry interferes with the development of public food policies worldwide through corporate political activity. And more specifically, when the 2019 version of the food guide was being developed. There is evidence that the bio-food industry was against the food guide's recommendations to limit processed foods and favor plant-based foods. I don't know about you, but this seems like a big win for the public and specifically for me, because this means that i don't need to eat an entire loaf of bread in a single day. I don't know, i look at this food guide and i feel really hopeful that it might be the right thing for me. But if i am honest with myself, i haven't been the best judge of my own eating habits in the past. So to be sure, i'm gonna talk to a registered dietician. - my name is nataly, i'm a registered dietician for jm nutrition, a private practice company. I provide nutrition counseling services. - what is the first step that you take when you are designing something for somebody? - i will say, first and foremost, a meal plan is not for everybody. Based on their history, if i feel like the meal plan might just be another type of diet that they feel they have to follow strictly to a tea, and if they don't, they might feel as though they've failed. That's never the intention. The meal plan is not meant to be this long-term thing that you follow for the rest of your life, but it's more so meant just to provide the foundation. Generally speaking, the meals should contain, you know, vegetables or maybe fruit, some type of protein, some type of complex carbohydrate that's high in fiber ideally, and then a sort of fat. I tend to often ask for their input in the meal plan too. I can certainly give suggestions and advice, but we wanna keep in mind what they're currently doing and can we sort of expand on that? There tends to be so much unknown food rigidity or just restrictive food beliefs or food rules that a lot of the times people don't necessarily realize are actually rooted in disordered eating, especially in diet culture. The idea of cheat days where, you know, a person will omit a certain food from their diet and then, you know, save up, \"for their saturday\" or whatever day of the week, you're creating the perfect scenario for bingeing. Once that binge or even just overeating ends up happening, a person will usually be filled with a lot of shame and guilt and negative self-talk, and then it's like a cycle 'cause they just omit that food again, but they're just setting themselves up for another binge all over again. - what would be your recommendation, like the first couple of steps that you would advise somebody to try to build a healthy relationship with food? - this might sound incredibly basic, but aiming to eat three meals a day and have snacks in between the meals. Oftentimes when i'm mention to people eating three meals a day, snacks in between, they might say to me, \"but natalie, i'm not actually hungry for breakfast, or i'm not actually hungry at whatever time.\" at that point, we wanna do more what's called mechanical eating. Just because i can't pick up on hunger cues doesn't mean my body magically doesn't need that energy. It still does, but that hunger cue was ignored for so long that the body adapted, a meal gets skipped, and then, you know, later on in the day, a person has to compensate by eating more. Even if you don't feel physically hungry for that meal, the more consistent you are with having it, those hunger cues can return. And i see that all the time with clients. Once it becomes more, you know, habitual, then we can sort of look into the more specific food beliefs. You know, how are you making certain food choices? How do you determine what's enough? What food groups or what foods are you incorporating? What are you not incorporating, and why is that? I think the biggest takeaway from my work with clients, regardless of where they're at with their relationship with food, is having food choices be guided by internal cues as opposed to external cues. How does my body feel when i incorporate these foods? I probably have more energy, maybe i have better mental health, maybe i'm sleeping better. And so, that can be a really great internal motivator to keep on taking part in those behaviors. - when i was younger, food and cooking were really a form of escape, but when i moved out, and i needed to cook every meal for myself, cooking became labor. And you gotta do it even when you're tired. And while i still believe that food can be romantic, sometimes a girl's just got to eat. While i don't think that a strict meal plan works for me, i will be using the new food guide as a reference to build my weekly grocery lists so that i can get into the habit of cooking more frequently. I don't think that i've completely fixed my energy issue, but i think that i have started to heal my relationship with food that i honestly didn't know needed mending. I'm really grateful that i could chat with nataly and clear up some big questions that i had. If you're interested in listening to our full conversation, you can find it in our newsletter page. And lastly, thank you again to trainwell for helping me keep active. You can find out more about both of them in the video description.",
        "token_count": 3849,
        "link": "https://www.youtube.com/watch?v=84zS-q4evTk"
    },
    "5aIPRw0RcvY": {
        "transcript": "- doing sound for film is a lot more involved than you might think. It's not just actors talking and a movie soundtrack. In this video, i explore the world of foley by training with a professional sound artist, recreating common sounds in uncommon ways, and learning about the hidden world of creating sounds for film. - [announcer] say, you sound effects men are a bunch of fakers. - that was so hard! - [taha] thank you to storyblocks for sponsoring a portion of this video and our patrons for supporting the channel. - so have you watched \"twisters\" recently? - kill me. i don't want to talk about \"twisters\". - i personally think it is one of the best movies to be released in the past five years. - how do you judge films? - i think the best part of a movie is the music. - i like the craft of movie making, you know? In writing, in direction, in cinematography. And then there's a whole area that people don't appreciate as much, which is the sound. - i think that sound is really important because it got us the line, \"if you feel it...\" - chase it! - chase it! - sound in movies is more than just dialogue. - i counter that. If you've watched the john mulaney award show where he's giving the award for best sound... - you know, for years movies didn't have sound, and then they figured it out. - he does in fact only talk about dialogue. - without sound, we wouldn't have been able to hear such classic lines as, \"you're gonna need a bigger boat.\" - i merely do not listen to john mulaney on account of the cheating. (everyone laughs) john mulaney fundamentally misunderstands how many different parts of sound exist. There's like the technical recording, and then there's the craft of sound design, sound editing, the foley, which is my favorite part of sound in movies. - so that's when somebody's just like, ah, picking up a cup. - i wish i had a bag of chips. (imitates bag rustling) - is not just, oh, i'm picking things up. There's technique involved. - pretty convincing impression of a twister. - i hate talking to you guys. (everyone laughs) because sabrina and melissa won't take me seriously, i've taken that personally. I'm gonna do the next most reasonable thing, interview an award-winning foley artist to prove my point. - hi, so my name is stephan fraticelli. I'm a foley artist. My company name is oddio studio. - [taha] stephan has worked on everything. From \"500 days of summer\" to \"parks and rec\", his imdb is crazy. - i would say my favorite at this point is \"the last of us\". It was really a great series. (gun clicks) (building booms) (metal creaks) we were recently nominated for an emmy award for that, so we're gonna be heading down. Fingers crossed. - and the emmy goes to the team from \"the last of us\". (audience cheers) - i often get asked by people who are not really familiar with foley in any great detail, why it exists in the first place, why they don't just take the audio that was originally recorded on set. There are many reasons. - sound recordists are focused on dialogue. They're making sure that the actors are clearly audible. So other sounds are deprioritized so that they get the cleanest recording on set. Because of this, they sometimes use fake or silent props to minimize the amount of noise from the environment in a production. But that's not realistic. - we go through afterwards and create anything that's related to the actor's movements, and that sits as a layer over the originally recorded dialogue track. - another reason might be noisy locations. Some of the ambient sound might be too overpowering for the details of a scene, and sometimes that can make the audio unusable. And a third reason might be the sounds that you expect to hear in film aren't actually the real sounds that would happen in that scenario. - when you pull a sword out of a sheath, it shouldn't have that sound. It should be silent. But people expect that to be there in a film. And it adds, yeah, it adds to the drama, so we do it. People don't always understand the distinction between what a foley artist does and what a sound effects editor does. Foley is always related to movement on screen. Like, if i was gonna describe a typical scene and the breakdown of how it would go, let's say somebody wakes up, goes down to their kitchen, makes a smoothie, has some coffee, and then leaves. We would do all their footsteps going down the stairs. We would do grabbing the fridge, pulling out the fruit, chopping it up, putting it into the blender. But then as soon as the blender goes on, that would be a sound effects editor cutting that sound in. And then sound effects editors would also have some sort of an ambient sound for the kitchen. Maybe the dishwasher's running, maybe there's other stuff going on. You really, as a new foley artist, have to start building up your own prop collection, things you're familiar with, so then when a sound comes up in a scene, you don't have to go scouring through an entire studio. I started putting a collection together with about six or seven small suitcases. Now that i've been at this facility for years, everything is here, i don't use the cases anymore, but i still know where it is in the entire studio. What you see when we're walking around here is like a huge compilation of 30 years of collection. - after talking to stephan, i decided if i really wanna prove my point to sabrina and melissa, i should do some foley myself. And in order to do that, i need to find some footage to foley. I can't just use any old film because i don't have the rights to every film in the world and i'm really not interested in going out and shooting my own clips. I want it to be something that i've never seen before that i've gotta foley. It's part of the challenge. So i've decided to find some clips on storyblocks, which happens to be the sponsor of this video as well. What they offer is perfect for us. It's a curated stock library with over a million pieces of footage. But it also has sound effects and music, which means that i can use their sound effects and music to create a soundscape that really sells the footage that i'm foleying. The other thing i like about storyblocks as opposed to typical stock footage sites is that storyblocks offers unlimited downloads for one subscription fee rather than a per clip basis, or having other hidden fees for licensing. You can use as many clips as you want from storyblocks without worrying about, ah, well i've just paid for this so i should use it, but it doesn't really fit in my story anymore. All of those worries are gone. You can just be creative for one simple subscription price. For this challenge, i'm looking for a really specific type of clip. I want it to be a busy environment with a lot of complex sounds, but i don't want the clip to be focused on a character, for example. I want it to be like a big, busy, bustling restaurant or bar or something like that where there's a bunch of tiny sounds that i need to put together. I think that'll give me a wide range of sounds to be foleying. And storyblocks is easy to use from search to editing to publishing. It's got a storyblocks plugin for the adobe cloud. And their search is actually very powerful because they'll also offer you clips that are similar to the one that you are looking at, something that'll be perfect for me when i'm searching for the perfect clip to foley. Storyblocks also keeps you legally covered. Anything you download from storyblocks is 100% royalty free, which means i don't have to worry about any complex licensing, and you can get yourself whitelisted on youtube for any clips that you use, which is ideal for me because i can actually show you what i'm doing with the footage without worrying about any copyright strikes on youtube. To get started with unlimited stock media downloads at one set price, head to  storyblocks.com/answerinprogress or click the link in the description. And if i'm gonna do some foleying, i thought i would get some help. So i decided to meet up with the only other foley nerd that i know. - taha! Welcome to the city. - thank you. - what you doing here? - i'm here to do some foleying. - ooh, i love foleying. - i got a clip from storyblocks. There's many things going on in this clip. - [colt] there is a lot. - should we just go through each of these? We've gotta break down the scene. - multiple things cooking out here. Two frying pans. - [taha] two frying pans. - [colt] and there's a pot in the back. Spatulas and some chopping. And then we have this dude in the back walking away. - what type of shoes do you think he's got on? Slightly heavier boots? - yeah, some more walking. Oh, here, right here. - [taha] oh, actually he's got like trainers. - you think he's a real chef? Who chefs up in that? What do you think about the sizzling? That's probably the hardest thing. - yeah, i saw a tiktok. Allegedly, you can have water and use pop rocks. So we're gonna try that. - shall we get to it? - let's do it. - let's do it. Get over here. get over here. - oh, this will have it. This will have it. This is so american. This is the most american thing of all time. Wait. - cracking gum? - cracking gum. (candy rustles) we got 'em. - i need a spatula. - spatula. - frying pan. - what do we need the frying pan for? - for the frying pan. - good. that's a good... - all right, you ready? You're recording? - i'm recording. (candy rustles and clangs against pan) (spatula clangs against pan) - that was not it. You think cast iron's not the move? 'cause it makes kind of like a hollow sound. - [taha] that does feel better. (pop rocks sizzle) (spatula clangs against pan) - more like put your hand back here. (spatula clangs against pan) ooh, that was pretty good. All right, now we're switching to the woman. We low-key need to like drop something in there. - [taha] what did she drop? like a- - [colt] little tomatoes after she cut them. - do you think there's like an interaction? Like, there's gonna be like a big amount of frying happening straight after the tomato? - i would assume so. - so i think we just drop more pop rocks. (pop rocks sizzle) - nice. i feel good about that one. Dang. who knew? I thought this was gonna be a piece of cake. This is hard. - oh, that was hard. - let's finish up the pans. We need the pan dropping. There's like a lift, up, down, scrape. What about if it's on the granite? I just feel like an electric stove top is like kind of like- - [taha] it's like a glass material. - but it's like kind of hollow. Like, it's not super solid. - [taha] what about on a chopping board? - i like that. - [taha] i'm just gonna get the one pickup. - that was pretty good. I think we just move on to placing the pan. - [taha] yeah, yeah. - there should be like kind of like a hit, flat. (pan sits) yeah. (pan sits repeatedly) i like those last three takes. - [taha] yeah. give me one more. - that's pretty good too. While we're here, you wanna do scale? - [taha] there's like a bit of a clatter. It's like... (scale clatters) - yeah, you're right. He like peels it. (scale clatters) - [taha] yeah. to be honest, that was perfect. (scale clatters repeatedly) i thought that was it. - [colt] yep. - [taha] we need to do the scrape. - maybe try no hands on it, like you're grabbing it? (scale slides) - chopping on plastic. (knife shings) (knife clangs) dude, that- - that was pretty good. - that was it. That was so good. - good stuff. We're trying to resemble boiling water, but we don't have an electronic stove top. So once the fire goes out, the water just stops boiling. - and the fire is too loud. - i have it. - okay. - straw. Straw. - straw. That's good. - that's good, right? So this is what, 13 seconds of bubble blowing? (bubbles rumble) low-key, i feel like boiling water is more aggressive. More bubbles. (bubbles rumble) do we think we got the shot? - [taha] i think so. - okay. - i was trying not to laugh 'cause it was so funny. Foot foley. the steps. - the steps. - okay. left guy. He goes one, two, three, four, five, six. And then three steps and then five steps. I'm not getting good sound. As we were trying to do the footsteps, we immediately realized that this was way harder than we thought. - the hardest thing for foley artists to do is footsteps. It may seem like a very simple basic thing, but to be able to walk in sort of a confined area and have your footsteps sound natural and also be in sync with the actors is a very long process to learn. As a result, it's generally the most senior people at any facility that handle doing the footsteps. These are just some of the shoes that i use on a regular basis. I actually have, i don't know, close to 200 pairs of shoes probably. These are one of my favorite women's heels. And they don't look like heels at all, right? - [taha] but they've got the sound. - yes. (heel taps) - [taha] wow. - when i was learning to do footsteps, i would often follow people like on the street or on the subway and try and walk in time with their footsteps to get used to doing sync and like stop when they stop and try not to be too close 'cause that is creepy. - all right, i think we're done. Now the final reveal. - [sabrina] we can't hear anything. - exactly. exactly, sabrina. It's dull. it's lifeless. And now the world premiere of me and colt's foley on this clip. (pans sizzle) (spatula clangs against pan) (footsteps) (pans sizzle) (scale clatters) - sounds like a kitchen. - that was nice. - do you see what we've done here? - kind of like you turned a microphone on in a kitchen, i guess. - it's not! We made every sound. Listen. (rock taps against pen) - he's so mad. - stop it. you would not be able to do better. - bet. - he's walking with whack shoes. - wait, we're doing it now? - yeah. Oh my god, you hit me with the mic. (melissa imitates car whirring) - oh no! Oh, that was so hard. Hey, i'm talking here. - it was pretty bad, i'm not gonna lie. (sabrina imitates car whirring) - oh! (sabrina laughs) - whoa! I really appreciate the sound effect for him falling was you yelling, \"fall!\" - okay. wait, what else could we use? - oh, we could use props. This sound. this sound here. Is that car-like? (boxes thud) - no, but we can- - kind of. - okay, okay, okay. I can be the car. You need to fall. - again? - why do you have a shovel? - i think that this could do something. (shovel clatters) that's falling. - it sounds like a plastic man falling. - there's a little bit of dirt in here. I'm gonna use that dirt for texture. - [taha] for texture? - 'cause he's walking on dirt. (shovel clatters) - [taha] they did a terrible job, and i'm not the only one who thought that. (melissa imitates car whirring) - the car is good. - oh, that was so hard. (everyone laughs) - okay. I think that's probably enough. (melissa laughs) i heard some footsteps. Sounded like more than one person. (everyone laughs) i noticed that the surface that you're on is very hard. It's like a tile surface versus dirt. - was me yelling, \"oh my god, the ground is so hard,\" did that go over? - yeah, i thought that was if you threw yourself on the ground for a body fall. Is that when that happened? I can't remember. - yeah. - yeah. - there was no sound though. - no, i heard the sound of pain, but not his pain. - give us a grade. - zero. - oh. - okay. Off the chop. - only up from here though. - only up from here! - [taha] so we jumped into sabrina and melissa's crash course on foley, and it started just as you'd expect. (chips crunch) (sabrina laughs) - i'm just gonna hold it to feel like i'm involved. But, taha, that's all you, bud. - damn. okay. - i'm scared. (footsteps) - that was so hard! - i feel like i'm learning how to walk again. (footsteps) (marker scratches) the last dot. - [taha] but after a while, i think they started to realize how difficult foley was. - ew! - [taha] and they really started to appreciate the level of skill it requires to do good foley. - i'm gonna close up all the curtains in here to eliminate all these interior reflections that you hear. - [sabrina] the room is getting quieter. It's freaking me out. It feels like the room is shrinking. - [taha] and more importantly how fun it could be. - the bits that you're seeing here are silica cat litter. Who wants to listen? - dibs. Whoa. it sounds even snowier. - whoa. (melissa laughs) and they started to appreciate it the same way i do. - that's... Wowee. (snow crunches) - sounds like snow to me. - [taha] so with our lessons complete, we thought it was only right to try and bring some sound to charlie chaplin again. - first we're gonna need some kind of a road surface. Rocky dirt. - ooh. - ooh. - [taha] that is a rocky dirt. Foley requires a level of technical knowledge about sound, how it reverberates and interacts with materials. - [stephan] when the line goes over, bang. - [taha] but also a sophisticated taste around what sounds people actually expect to hear. It requires rhythm and focus as both art, like dance or music, and precise, like building a delicate structure. You have to build a realistic sounding orchestra of noises, some of which might not even exist in real life. - [stephan] pretend it's like a ouija board or something. - yeah! - [taha] sometimes you go to an art gallery and think, \"i could paint that.\" but then when you actually try, you realize the incredible depth and skill it takes to actually master a craft. Sound in film is one of the most unforgiving parts of making a movie. If it's bad, then it's the only thing anyone can pay attention to. - that's not as deep as she got. - but if it's brilliant, it just melts into the story and goes totally unnoticed until someone at an award show somewhere makes a joke about how the sound was fine. - you know, for years, movies didn't have sound, and then they figured it out. (footsteps) (car whirs) (body thuds) (car whirs) (body thuds) (duster rustles) - [taha] oh. whoa, this is great. (everyone laughs) charlie chaplin is funnier with sounds. - what? wow. We fixed charlie chaplin. - we fixed charlie chaplin. - you improved i would say to like a nine outta 10 from maybe one. And i would not hire you. - if you wanna learn more about stephan and his process, we've made an entire 30 minute mini-documentary for patreon. There was so much that we filmed and talked about with stephan and we couldn't fit it all into this video. - [sabrina] that's a fabric. - [stephan] it is. it's sheepskin. But then when it's soaking wet... - ew! (sheepskin sloshes) - [taha] oh my god. - oh my god! It's actually very nice to touch. It sounds gross though. - [taha] and if you're curious about little snippets about how sounds are made, you can also find that on his instagram.",
        "token_count": 4697,
        "link": "https://www.youtube.com/watch?v=5aIPRw0RcvY"
    }
}